dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.c
#if defined(GPIOG)						//pins 80..96
	{GPIOG, 1<<0},						//STM32duino Pin 32 = RP0/PB0/CHIP PIN4
	{GPIOG, 1<<1},						//STM32duino Pin 33 = RP1/PB1/CHIP PIN5
	{GPIOG, 1<<2},						//STM32duino Pin 34 = RP2/PB2/CHIP PIN6
	{GPIOG, 1<<3},						//STM32duino Pin 35 = RP3/PB3/CHIP PIN7
	{GPIOG, 1<<4},						//STM32duino Pin 36 = RP4/PB4/CHIP PIN11
	{GPIOG, 1<<5},						//STM32duino Pin 37 = RP5/PB5/CHIP PIN14
	{GPIOG, 1<<6},						//STM32duino Pin 38 = RP6/PB6/CHIP PIN15
	{GPIOG, 1<<7},						//STM32duino Pin 39 = RP7/PB7/CHIP PIN16
	{GPIOG, 1<<8},						//STM32duino Pin 40 = RP8/PB8/CHIP PIN17
	{GPIOG, 1<<9},						//STM32duino Pin 41 = RP9/PB9/CHIP PIN18
	{GPIOG, 1<<10},						//STM32duino Pin 42 = RP10/PB10/CHIP PIN21
	{GPIOG, 1<<11},						//STM32duino Pin 43 = RP11/PB11/CHIP PIN22
	{GPIOG, 1<<12},						//STM32duino Pin 44 = RP12/PB12/CHIP PIN23
	{GPIOG, 1<<13},						//STM32duino Pin 45 = RP13/PB13/CHIP PIN24
	{GPIOG, 1<<14},						//STM32duino Pin 46 = RP14/PB14/CHIP PIN25
	{GPIOG, 1<<15},						//STM32duino Pin 47 = RP15/PB15/CHIP PIN26
#endif	//GPIOG
};

//set up core timer
//global variables

//for time base off TIMER1 @ 1:1 prescaler
//volatile uint32_t timer1_millis = 0;
volatile uint32_t timer_ticks = 0;
//static uint16_t timer1_fract = 0;

//timer1 overflow isr
//void _ISR_PSV _T2Interrupt(void) {
//	IFS0bits.T2IF=0;					//clear tmr1 interrupt flag
//	timer_ticks+=0x10000ul;				//increment overflow count: 16-bit timer
//}

//configure gpio DDR mode (cnf1..0 + mod1..0 bits)
void GPIO_DDR(GPIO_TypeDef * GPIOx, uint32_t mask, uint32_t mode) {
	uint8_t pos=0, posx2;
	//uint32_t pin_mask;

	while (mask) {								//for (pos=0; pos < 16; pos++) {
		//looking for pin position / mask
		//pin_mask = 1ul << pos;
		if (mask & (1ul << 0)) {				//if (mask & (1ul << pos)) {
			posx2=pos * 2;
			//we have found the pos / pin_mask
			if ((mode & GPIOMODE_OUTPUT) || (mode & GPIOMODE_AF)) {
				GPIOx->OSPEEDR &=~(0x03ul << (posx2));	//clear ospeeder
				GPIOx->OSPEEDR |= (0x01ul << (posx2));	//set to medium speed (0x01)

				GPIOx->OTYPER &=~(1ul << pos);				//clear otyper
				GPIOx->OTYPER |= ((mode & GPIOMODE_PP)?0ul:1ul) << pos;	//0->pp, 1->od
			}

			GPIOx->MODER &=~(0x03 << (2 * pos));			//clear moder
			GPIOx->MODER |= (mode & 0x03) << (posx2);		//set moder

			GPIOx->PUPDR &=~(0x03 << (posx2));			//clear pupdr
			GPIOx->PUPDR |= ((mode >> 4) & 0x03) << (posx2);	//set pupdr
		}
		mask = mask >> 1;
		pos = pos + 1;
	}
}

//empty interrupt handler
void empty_handler(void) {
	//do nothing here
}

//global variables
//for time base off SysTick (24-bit counter)
volatile uint32_t systick_ovf = 1ul<<24;						//time base on Systick -> SysTick->VAL being the lowest 24-bits (SysTick is a downcounter)
static void (* _systick_isrptr)(void)=empty_handler;				//systick_ptr pointing to empty_handler by default


//systick handler - to provide time base for millis()/micros()
void SysTick_Handler(void) {
	//clear the flag
	systick_ovf += 1ul<<24;						//increment systick counter - 24bit, 1:1 prescaler
	_systick_isrptr();									//execute systick isr
}

//install systick isr
//activate the isr handler
void systickAttachISR(void (*isrptr)(void)) {
	_systick_isrptr = isrptr;
}

//new code
//clock mgmt
//switch system clock
//clock choices: RCC_CFGR_SW_HSI, RCC_CFGR_SW_HSE, RCC_CFGR_SW_PLL (from HSI or HSE)
void SystemCoreClockConfig(uint32_t clk) {
	switch (clk) {
		case RCC_CFGR_SW_HSI: RCC->CR  |= RCC_CR_HSION;   while ((RCC->CR  & RCC_CR_HSIRDY  )== 0) continue; RCC->CFGR = (RCC->CFGR &~RCC_CFGR_SW) | clk; break;	//turn on HSI and wait for it to stablize
		case RCC_CFGR_SW_HSE: RCC->CR  |= RCC_CR_HSEON;   while ((RCC->CR  & RCC_CR_HSERDY  )== 0) continue; RCC->CFGR = (RCC->CFGR &~RCC_CFGR_SW) | clk; break;	//turn on HSe and wait for it to stablizebreak;
#if defined(RCC_CFGR_SWS_PLL)
		case RCC_CFGR_SW_PLL: RCC->CR  |= RCC_CR_PLLON;   while ((RCC->CR  & RCC_CR_PLLRDY  )== 0) continue; RCC->CFGR = (RCC->CFGR &~RCC_CFGR_SW) | clk; break;	//turn on PLL and wait for it to stablizebreak;
#endif	//pll
		case RCC_CFGR_SW_LSI: RCC->CSR |= RCC_CSR_LSION;  while ((RCC->CSR & RCC_CSR_LSIRDY )== 0) continue; RCC->CFGR = (RCC->CFGR &~RCC_CFGR_SW) | clk; break;	//turn on LSI and wait for it to stablizebreak;
#if defined(RCC_CFGR_SWS_LSE)
		case RCC_CFGR_SW_LSE: RCC->BDCR|= RCC_BDCR_LSEON; while ((RCC->BDCR& RCC_BDCR_LSERDY)== 0) continue; RCC->CFGR = (RCC->CFGR &~RCC_CFGR_SW) | clk; break;	//turn on LSE and wait for it to stablizebreak;
#endif	//lse
	}
	SystemCoreClockUpdate();								//update the clock
}

#if !defined(PY32F002Ax5)
//set pll
//fixed 2x
void pllSet(void) {
	FLASH->ACR = (FLASH->ACR & FLASH_ACR_LATENCY) | (1<<FLASH_ACR_LATENCY_Pos);	//1->above 24M, 0->at or below 24M

	//switch to HSI to be safe
	//RCC->CR |= RCC_CR_HSION; while ((RCC->CR & RCC_CR_HSIRDY) == 0) continue; RCC->CFGR = (RCC->CFGR &~RCC_CFGR_SW) | RCC_CFGR_SW_HSI; 
	//enable pll
	RCC->PLLCFGR &=~RCC_PLLCFGR_PLLSRC;	//0->HSI, 1->HSE
	//do {RCC->CR |= RCC_CR_PLLON;} while ((RCC->CR & RCC_CR_PLLRDY) == 0);
	RCC->CR |= RCC_CR_PLLON; while ((RCC->CR & RCC_CR_PLLRDY) == 0) continue; 				//wait for rcc to be powered down
	
	//readjust flash latency if clock is less than 24Mhz
	if (AHBClock() < 24000000ul) FLASH->ACR = (FLASH->ACR & FLASH_ACR_LATENCY) | (0<<FLASH_ACR_LATENCY_Pos);	//1->above 24M, 0->below 24M
}

//get pll speed
uint32_t PLLClock(void) {
	uint32_t tmp=0;
	if (RCC->PLLCFGR & RCC_PLLCFGR_PLLSRC) tmp = F_HSE; else tmp = F_HSI;
	return 2*tmp;					//pll fixed at 2x
}
#endif

//set hsi frequency
//hsi_fs = HSI_FS24, HSI_FS22, HSI_FS16, HSI_FS8, HSI_FS4
uint32_t F_HSISet(uint32_t f_hsi) {
	uint32_t tmp;
	
	switch (f_hsi) {
		case HSI_FS24: tmp = HSI_FS24 | ((HSI24TRIM << RCC_ICSCR_HSI_TRIM_Pos) & RCC_ICSCR_HSI_TRIM); break;
		case HSI_FS22: tmp = HSI_FS22 | ((HSI22TRIM << RCC_ICSCR_HSI_TRIM_Pos) & RCC_ICSCR_HSI_TRIM); break;
		case HSI_FS16: tmp = HSI_FS16 | ((HSI16TRIM << RCC_ICSCR_HSI_TRIM_Pos) & RCC_ICSCR_HSI_TRIM); break;
		case HSI_FS8 : tmp = HSI_FS8  | ((HSI8TRIM  << RCC_ICSCR_HSI_TRIM_Pos) & RCC_ICSCR_HSI_TRIM); break;
		case HSI_FS4 : tmp = HSI_FS4  | ((HSI4TRIM  << RCC_ICSCR_HSI_TRIM_Pos) & RCC_ICSCR_HSI_TRIM); break;
		default: f_hsi=0;
	}
	RCC->ICSCR = (RCC->ICSCR &~(RCC_ICSCR_HSI_FS | RCC_ICSCR_HSI_TRIM)) | tmp;
	return f_hsi;
}

//get hsi frequency
//hsi_fs = HSI_FS24, HSI_FS22, HSI_FS16, HSI_FS8, HSI_FS4
uint32_t F_HSIGet(void) {
	uint32_t tmp;
	
	switch (RCC->ICSCR & RCC_ICSCR_HSI_FS) {
		case HSI_FS24: tmp = F_HSI24; break;
		case HSI_FS22: tmp = F_HSI22; break;
		case HSI_FS16: tmp = F_HSI16; break;
		case HSI_FS8 : tmp = F_HSI8 ; break;
		case HSI_FS4 : tmp = F_HSI4 ; break;
		default: tmp=0;
	}
	return tmp;
}

//hsi_fs = HSI_FS24, HSI_FS22, HSI_FS16, HSI_FS8, HSI_FS4
//Get factory HSITrim
uint32_t HSITrimGetF(void) {
	uint32_t tmp;
	
	switch (RCC->ICSCR & RCC_ICSCR_HSI_FS) {
		case HSI_FS24: tmp = HSI24TRIM; break;
		case HSI_FS22: tmp = HSI22TRIM; break;
		case HSI_FS16: tmp = HSI16TRIM; break;
		case HSI_FS8 : tmp = HSI8TRIM ; break;
		case HSI_FS4 : tmp = HSI4TRIM ; break;
		default: tmp=0;
	}
	return tmp;
}

//get SYSCLK speed, just beofre AHBDIV
uint32_t SYSClock(void) {
	uint32_t tmp=0;
	switch (RCC->CFGR & RCC_CFGR_SWS) {
		case RCC_CFGR_SWS_HSI: tmp = F_HSI; break;
		case RCC_CFGR_SWS_HSE: tmp = F_HSE; break;
#if !defined(PY32F002Ax5)
		case RCC_CFGR_SWS_PLL: tmp = F_PLL; break;
#endif
		case RCC_CFGR_SWS_LSI: tmp = F_LSI; break;
#if !defined(PY32F002Ax5)
		case RCC_CFGR_SWS_LSE: tmp = F_LSE; break;
#endif
	}
	return tmp;
}

//get AHBClock, after AHBDIV
uint32_t AHBClock(void) {
	//uint32_t tmp;

	return SYSClock() >> ((RCC->CFGR & RCC_CFGR_HPRE_Msk) >> RCC_CFGR_HPRE_Pos);
}

//get APB speed
uint32_t APBClock(void) {
	//uint32_t tmp;
	return AHBClock() >> ((RCC->CFGR & RCC_CFGR_PPRE_Msk) >> RCC_CFGR_PPRE_Pos);								//get AHB speed
}

