dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.c
//get TIM_PCLK speed
uint32_t TIMClock(void) {
	return ((RCC->CFGR & RCC_CFGR_PPRE_Msk) == RCC_CFGR_PPRE_0)?APBClock():(2*APBClock());
}

//uart1 speed = APBClock()
uint32_t u1FreqGet(void) {
	return APBClock();
}


//reset the mcu
void mcuInit(void) {
	//waste time - for debugging
	volatile uint32_t i=100000ul; while (i--) continue;
	
	//set up the clock - default hsi@8M
	//SystemCoreClockHSI();						//systemcoreclock to HSI - default 8M
	//SystemCoreClockHSIPLL();					//systemcoreclock to HSI
	//SystemCoreClockHSE();						//systemcoreclock to HSE
	//SystemCoreClockHSEPLL();					//systemcoreclock to HSExpll
	//SystemCoreClockHSI4M();					//select hsi clock
	//SystemCoreClockHSI22MPLL();				//select hsixpll as clock

	//enable clock to GPIO
	RCC->IOPENR |=
#if defined(GPIOA)
			RCC_IOPENR_GPIOAEN |
#endif
#if defined(GPIOB)
			RCC_IOPENR_GPIOBEN |
#endif
#if defined(GPIOC)
			RCC_IOPENR_GPIOCEN |
#endif
#if defined(GPIOD)
			RCC_IOPENR_GPIODEN |
#endif
#if defined(GPIOE)
			RCC_IOPENR_GPIOEEN |
#endif
#if defined(GPIOF)
			RCC_IOPENR_GPIOFEN |
#endif
#if defined(GPIOG)
			RCC_IOPENR_GPIOGEN |
#endif
			0x00;
	
	//start systick / coretick
	//configure Systick as the time base for millis()/micros()

	systick_ovf = 1ul<<24;											//SysTick is a 24-bit downcounter
	//for chips where SysTick_Config() is not defined in cmsis
	SysTick->LOAD  = 	(systick_ovf-1)/*ticks*/ & SysTick_LOAD_RELOAD_Msk;      /* set reload register */
	SysTick->VAL   = 	0;                                          /* Load the SysTick Counter Value */
	SysTick->CTRL  = 	SysTick_CTRL_CLKSOURCE_Msk |
						SysTick_CTRL_TICKINT_Msk   |
						SysTick_CTRL_ENABLE_Msk;                    /* Enable SysTick IRQ and SysTick Timer */
	NVIC_SetPriority 	(SysTick_IRQn, (1<<__NVIC_PRIO_BITS) - 1);  /* set Priority for Systick Interrupt */
	_systick_isrptr = empty_handler;
	//alternative - for CMSIS-equip'd chips
	//SysTick_Config(SysTick_LOAD_RELOAD_Msk);			//reload all 24 bits

	//enable global interrupts
	ei();										//testing

	//update SystemCoreClock - it must be the last step before exiting mcuInit
	SystemCoreClockUpdate();
}

//return timer clicks
//execution time = 30 ticks, no optimization
uint32_t systicks(void) {
	volatile uint32_t m;
	volatile uint32_t f;

	//do a double read
	do {
		m = systick_ovf;			//read the overflow counter
		f = SysTick->VAL;				//read the least significant 16-bits
	} while (m != systick_ovf);	//guard against overflow

	return (m - f) << 0;				//systick is a 24-bit downcounter
}

//C main loop
int main(void) {

	mcuInit();						//reset the mcu
	setup();						//run the setup code
	while (1) {
		loop();						//run the default loop
	}
}


//Arduino Functions: GPIO
//set a pin mode to INPUT or OUTPUT
//no error checking on PIN
#define inline						//supress inline decalration
inline void pinMode(PIN_TypeDef pin, uint8_t mode) {
	GPIO_TypeDef *gpio=GPIO_PinDef[pin].gpio;
	uint16_t mask = GPIO_PinDef[pin].mask;
	
	//if (mode==OUTPUT) IO_OUT(gpio, mask); else IO_IN(gpio, mask);
	switch (mode) {
		case OUTPUT: 		IO_OUTPP(gpio, mask); break;
		case OUTPUT_OD: 	IO_OUTOD(gpio, mask); break;
		case INPUT: 		IO_INFL(gpio, mask); break;
		case INPUT_PU: 		IO_INPU(gpio, mask); break;
		case INPUT_PD: 		IO_INPD(gpio, mask); break;
	}
}

//set / clear a pin
inline void digitalWrite(PIN_TypeDef pin, uint8_t val) {
	GPIO_TypeDef *gpio=GPIO_PinDef[pin].gpio;
	uint16_t mask = GPIO_PinDef[pin].mask;
	
	if (val==LOW) IO_CLR(gpio, mask); else IO_SET(gpio, mask);
}

//read a pin
inline int digitalRead(PIN_TypeDef pin) {
	GPIO_TypeDef *gpio=GPIO_PinDef[pin].gpio;
	uint16_t mask = GPIO_PinDef[pin].mask;

	return (IO_GET(gpio, mask))?HIGH:LOW;
}
//Arduino Functions: GPIO
//helper functions
uint32_t pinPos(uint32_t mask) {
	uint32_t tmp=0;
	while ((mask & (1ul<<tmp)) == 0) tmp++;
	return tmp;
}

//configure pin for AFIO: AFIOn:[0..15]
void pinAFIO(PIN_TypeDef pin, AFIO_TypeDef AFIOn) {
	uint32_t pos;
	GPIO_TypeDef *gpio;

	gpio=GPIO_PinDef[pin].gpio;
	//mask=GPIO_PinDef[pin].mask;
	pos = pinPos(GPIO_PinDef[pin].mask);
	gpio->MODER = (gpio->MODER &~(/*0b11*/0x03<<(2* pos))) | (/*0b10*/0x02<<(2* pos));	//0x02->AFIO
	gpio->OTYPER &=~(1<< pos);	//0->default
	gpio->OSPEEDR = (gpio->OSPEEDR &~(/*0b11*/0x03<<(2* pos))) | (/*0b01*/0x01<<(2* pos));	//0x01->low speed
	if (pos<8) gpio->AFR[0] = (gpio->AFR[0] &~(0x0f<<(4*( pos%8)))) | ((AFIOn-AFIO0)<<(4*( pos%8)));
	else gpio->AFR[1] = (gpio->AFR[1] &~(0x0f<<(4*( pos%8)))) | ((AFIOn-AFIO0)<<(4*( pos%8)));
}
//end GPIO

//ticks()
//Arduino Functions: Time
//return timer ticks
	
//delay millisseconds
//void delay(uint32_t ms) {
//	uint32_t start_time = ticks();
//	ms *= cyclesPerMillisecond();
//	while (ticks() - start_time < ms) continue;
//}

//delay micros seconds
//void delayMicroseconds(uint32_t us) {
//	uint32_t start_time = ticks();
//	us *= cyclesPerMicrosecond();
//	while (ticks() - start_time < us) continue;
//}

//delay ticks
void delayTks(uint32_t tks) {
	uint32_t start_time = ticks();
	while (ticks() - start_time < tks) continue;
}

//end Time

//generic uart reset routine - to save space
void uartInit(USART_TypeDef *USARTx, unsigned long baudrate) {
	//uint32_t uartdiv;

	USARTx->CR1 &=~(1<<0);			//'0'->disable uart, '1'->enable uart
    USARTx->CR1 =	(0<<28) | (0<<12) |	//0b00->1 start bit, 8 data bits, n stop bit; 0b01->1 start bit, 9 data bits, n stop bit, 0b10->1 start bit 7 data bits, n stop bit
    				(0<<27) |		//0->disable end of block interrupt
    				(0<<26) |		//0->receiver timeout interrupt disabled
    				(0x00<<21) |	//0b00000->driver enable assertion time
    				(0x00<<16) |	//0b00000->driver enable disassertion time
    				(0<<15) |		//0->oversampling by 16, 1->oversampling by 8
    				(0<<14) |		//0->character match interrupt disabled
    				(0<<13) |		//0->receiver in active mode permanently
    				//bit 12 set earlier
    				(0<<11) |		//0->idle line to wake up uart
    				(0<<10) |		//0->no parity
    				(0<<9) |		//0->even parity
    				(0<<8) |		//0->disable PE interrupt
    				(0<<7) |		//0->disable txie)
    				(0<<6) |		//0->disable transmission complete interrupt
    				(0<<5) |		//0->disable receiver buffer not empty interrupt
    				(0<<4) |		//0->disable idle interrupt
    				(1<<3) |		//0->transmitter disabled, 1->transmitter enabled
    				(1<<2) |		//0->receiver disabled, 1->receiver enabled
    				//bit 1 reserved
    				(0<<0) |		//0->disable uart, 1->enable uart
    				0x00;
    USARTx->CR2 = 	(0x00<<28) |	//address of the uart
    				(0x00<<24) |	//address of the uart
    				(0<<23) |		//0->disable receiver time out
    				(0x00<<21) |	//00->measurement of the start bit used to detect baud rate
    				(0<<20) |		//auto baud rate disabled
    				(0<<19) |		//0->data bit 0 first
    				(0<<18) |		//0->data transmitted / received in positive logic
    				(0<<17) |		//0->tx in positive logic
    				(0<<16) |		//0->rx in positive logic
    				(0<<15) |		//0->tx/rx pins not swapped, 1->tx/rx pins swapped
    				(0x00<<12) |	//00->1 stop bit, 10->2 stop bit, 11->1.5 stop bit
    				(0<<11) |		//0->sclk disabled
    				(0<<10) |		//0->sclk idles low
    				(0<<9) |		//0->clock on first data capture
    				(0<<8) |		//0->clock on the last bit is not data pulse
    				(0<<4) |		//0->4 bit address detection
    				0x00;
    USARTx->CR3 =	(0<<15) |		//0->driver enable signal active high
    				(0<<14) |		//0->disable driver more
    				0x00;			//reset value
    //set the baudrate register
    USARTx->BRR = (F_UART + baudrate / 2) / baudrate;						//without rounding: F_UART / baudrate
    //USARTx->BRR /= (USARTx->CR1 & (1<<15))?2:1;		//per datasheet, for OVER8=0 or 1

    //USARTx->DR = 0;					//reset the data register
    //USARTx->SR = 0;					//reset the data register

