dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.c
    //enable uart1
    USARTx->CR1 |= USART_CR1_UE;		//'0'->disable uart, '1'->enable uart

}

//generic print to uart buffer
void uPrint(char *uRAM, int32_t dat) {
	uint8_t idx=20;						//buffer index
	uint8_t negFlag=0;					//flag for negative sign: 1->negative, 0->positive

	if (dat<0) {negFlag = 1; dat = -dat;}
#if 1	//36k/invocation
	uRAM[idx--]='0'+(dat % 10); dat /= 10;
	uRAM[idx--]='0'+(dat % 10); dat /= 10;
	uRAM[idx--]='0'+(dat % 10); dat /= 10;
	uRAM[idx--]=',';	//'0'+(dat % 10); dat /= 10;
	uRAM[idx--]='0'+(dat % 10); dat /= 10;
	uRAM[idx--]='0'+(dat % 10); dat /= 10;
	uRAM[idx--]='0'+(dat % 10); dat /= 10;
	uRAM[idx--]=',';	//'0'+(dat % 10); dat /= 10;
	uRAM[idx--]='0'+(dat % 10); dat /= 10;
	uRAM[idx--]='0'+(dat % 10); dat /= 10;
	uRAM[idx--]='0'+(dat % 10); dat /= 10;
	uRAM[idx--]=',';	//'0'+(dat % 10); dat /= 10;
	uRAM[idx--]='0'+(dat % 10); dat /= 10;
#else	//36k/invocation
	uint32_t tmp;

	tmp = dat; dat /= 10; uRAM[idx--]='0'+(tmp - dat * 10);
	tmp = dat; dat /= 10; uRAM[idx--]='0'+(tmp - dat * 10);
	tmp = dat; dat /= 10; uRAM[idx--]='0'+(tmp - dat * 10);
	                      uRAM[idx--]=',';
	tmp = dat; dat /= 10; uRAM[idx--]='0'+(tmp - dat * 10);
	tmp = dat; dat /= 10; uRAM[idx--]='0'+(tmp - dat * 10);
	tmp = dat; dat /= 10; uRAM[idx--]='0'+(tmp - dat * 10);
	                      uRAM[idx--]=',';
	tmp = dat; dat /= 10; uRAM[idx--]='0'+(tmp - dat * 10);
	tmp = dat; dat /= 10; uRAM[idx--]='0'+(tmp - dat * 10);
	tmp = dat; dat /= 10; uRAM[idx--]='0'+(tmp - dat * 10);
	                      uRAM[idx--]=',';
	tmp = dat; dat /= 10; uRAM[idx--]='0'+(tmp - dat * 10);
#endif
	uRAM[idx--]=negFlag?'-':' ';
}

//uart1
//initialize usart: high baudrate (brgh=1), 16-bit baudrate (brg16=1)
//baudrate=Fxtal/(4*(spbrg+1))
//spbrg=(Fxtal/4/baudrate)-1
//tx/rx pins to be assumed in gpio mode
//data bits: 	8
//parity: 		none
//stop bits: 	1
//Xon/Xoff:		none
void uart1Init(unsigned long baudrate) {
	//uint16_t uartdiv;

	//configure uart1
    //route clock to uart1
    RCC->APBENR2 |= RCC_APBENR2_USART1EN;

	//reset usart
	uartInit(USART1, baudrate);

    //configure the TX-PA9/RX-PA10 pins - GPIO clock assumed enabled here previously
    //RX as floating input/AF input, AF1
    //IO_INFL(GPIOA, 1<<10); GPIOA->AFR[1] = (GPIOA->AFR[1] &~(0x0f << (4 * (10-8)))) | (1<<(4 * (10-8)));
	//TX as AFPP, AF1
    //IO_AFPP(GPIOA, 1<< 9); GPIOA->AFR[1] = (GPIOA->AFR[1] &~(0x0f << (4 * ( 9-8)))) | (1<<(4 * ( 9-8)));
#if defined(U1TX2PIN)
    U1TX2PIN();
#endif

#if defined(U1RX2PIN)
    U1RX2PIN();
#endif
}

void uart1Putch(char ch) {
    //while (!(USART1->SR & USART_SR_TXE));    	//wait for the transmission buffer to be empty
    while (uart1Busy()) continue;    			//wait for the transmission buffer to be empty
    USART1->DR = ch;                        	//load the data buffer
    //while (!(USART1->SR & (1<<6)));    		//wait for the transmission to complete
}

//put a string
void uart1Puts(char *str) {
	while (*str) uart1Putch(*str++);
}

/*

Writes a line of text to USART and goes to new line
The new line is Windows style CR/LF pair.

This will work on Hyper Terminal Only NOT on Linux

*/

//put a line termined with ln
void uart1Putline(char *ln) {
	//USARTWriteString(ln);
	uart1Puts(ln);
	//USARTWriteString("\r\n");
	uart1Puts((char *)"\r\n");
}

//get the received char
uint8_t uart1Getch(void) {
	   //while (!(USART1->SR & USART_SR_RXNE));  	//wait for the receipt buffer to be empty
	    return USART1->DR;                       	//save the transmission buffer
}

//test if data rx is available
uint16_t uart1Available(void) {
	//return (USART1->SR & USART_SR_TC)?true:false;
	return (USART1->SR & USART_SR_RXNE);
}

//test if uart tx is busy
uint16_t uart1Busy(void) {
    return !(USART1->SR & USART_SR_TXE);    	//return 1 if TX buffer is empty
}

//print to uart1
void u1Print(char *str, int32_t dat) {
	static char uRAM[uRAM_SIZE];						//transmission buffer, 40-1 char max
	
	strcpy(uRAM, str);					//copy to uarm
	uPrint(uRAM, dat);					//print to uRAM
	uart1Puts(uRAM);					//send a message on uart1
}	

#if defined(USART2)
//uart2
//initialize usart: high baudrate (brgh=1), 16-bit baudrate (brg16=1)
//baudrate=Fxtal/(4*(spbrg+1))
//spbrg=(Fxtal/4/baudrate)-1
//tx/rx pins to be assumed in gpio mode
//data bits: 	8
//parity: 		none
//stop bits: 	1
//Xon/Xoff:		none
void uart2Init(unsigned long baudrate) {
	//uint16_t uartdiv;

	//configure uart1
    //route clock to uart1
    RCC->APBENR1 |= RCC_APBENR1_USART2EN;

	//reset usart
	uartInit(USART2, baudrate);

    //configure the TX-PA9/RX-PA10 pins - GPIO clock assumed enabled here previously
    //RX as floating input/AF input, AF1
    //IO_INFL(GPIOA, 1<<10); GPIOA->AFR[1] = (GPIOA->AFR[1] &~(0x0f << (4 * (10-8)))) | (1<<(4 * (10-8)));
	//TX as AFPP, AF1
    //IO_AFPP(GPIOA, 1<< 9); GPIOA->AFR[1] = (GPIOA->AFR[1] &~(0x0f << (4 * ( 9-8)))) | (1<<(4 * ( 9-8)));
#if defined(U2TX2PIN)
    U2TX2PIN();
#endif
#if defined(U2RX2PIN)
    U2RX2PIN();
#endif


}

void uart2Putch(char ch) {
	   //while (!(USART2->SR & USART_SR_TXE));    	//wait for the transmission buffer to be empty
	    while (uart2Busy()) continue;    			//wait for the transmission buffer to be empty
	    USART2->DR = ch;                        	//load the data buffer
	    //while (!(USART2->SR & (1<<6)));    		//wait for the transmission to complete
}

void uart2Puts(char *str) {
	while (*str) uart2Putch(*str++);
}

/*

Writes a line of text to USART and goes to new line
The new line is Windows style CR/LF pair.

This will work on Hyper Terminal Only NOT on Linux

*/

void uart2Putline(char *ln) {
	//USARTWriteString(ln);
	uart2Puts(ln);
	//USARTWriteString("\r\n");
	uart2Puts((char *)"\r\n");
}

uint8_t uart2Getch(void) {
	   //while (!(USART2->SR & USART_SR_RXNE));  	//wait for the receipt buffer to be empty
	    return USART2->DR;                       	//save the transmission buffer
}

