dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.c
//test if data rx is available
uint16_t uart2Available(void) {
	//return (USART2->SR & USART_SR_TC)?true:false;
	return (USART2->SR & USART_SR_RXNE);
}

//test if uart tx is busy
uint16_t uart2Busy(void) {
	   return !(USART2->SR & USART_SR_TXE);    	//return 1 if TX buffer is empty
}

//print to uart2
void u2Print(char *str, int32_t dat) {
	static char uRAM[uRAM_SIZE];						//transmission buffer, 40-1 char max
	
	strcpy(uRAM, str);					//copy to uarm
	uPrint(uRAM, dat);					//print to uRAM
	uart2Puts(uRAM);					//send a message on uart1
}	
#endif		//USART2

#if defined(USART3)
//uart3
//initialize usart: high baudrate (brgh=1), 16-bit baudrate (brg16=1)
//baudrate=Fxtal/(4*(spbrg+1))
//spbrg=(Fxtal/4/baudrate)-1
//tx/rx pins to be assumed in gpio mode
//data bits: 	8
//parity: 		none
//stop bits: 	1
//Xon/Xoff:		none
void uart3Init(unsigned long baudrate) {
	//uint16_t uartdiv;

	//configure uart1
    //route clock to uart1
    RCC->APBENR1 |= RCC_APBENR1_USART3EN;

	//reset usart
	uartInit(USART3, baudrate);

    //configure the TX-PA9/RX-PA10 pins - GPIO clock assumed enabled here previously
    //RX as floating input/AF input, AF1
    //IO_INFL(GPIOA, 1<<10); GPIOA->AFR[1] = (GPIOA->AFR[1] &~(0x0f << (4 * (10-8)))) | (1<<(4 * (10-8)));
	//TX as AFPP, AF1
    //IO_AFPP(GPIOA, 1<< 9); GPIOA->AFR[1] = (GPIOA->AFR[1] &~(0x0f << (4 * ( 9-8)))) | (1<<(4 * ( 9-8)));
#if defined(U2TX2PIN)
    U2TX2PIN();
#endif
#if defined(U2RX2PIN)
    U2RX2PIN();
#endif


}

void uart3Putch(char ch) {
	   //while (!(USART3->SR & USART_SR_TXE));    	//wait for the transmission buffer to be empty
	    while (uart3Busy()) continue;    			//wait for the transmission buffer to be empty
	    USART3->DR = ch;                        	//load the data buffer
	    //while (!(USART3->SR & (1<<6)));    		//wait for the transmission to complete
}

void uart3Puts(char *str) {
	while (*str) uart3Putch(*str++);
}

/*

Writes a line of text to USART and goes to new line
The new line is Windows style CR/LF pair.

This will work on Hyper Terminal Only NOT on Linux

*/

void uart3Putline(char *ln) {
	//USARTWriteString(ln);
	uart3Puts(ln);
	//USARTWriteString("\r\n");
	uart3Puts((char *)"\r\n");
}

uint8_t uart3Getch(void) {
	   //while (!(USART3->SR & USART_SR_RXNE));  	//wait for the receipt buffer to be empty
	    return USART3->DR;                       	//save the transmission buffer
}

//test if data rx is available
uint16_t uart3Available(void) {
	//return (USART3->SR & USART_SR_TC)?true:false;
	return (USART3->SR & USART_SR_RXNE);
}

//test if uart tx is busy
uint16_t uart3Busy(void) {
	   return !(USART3->SR & USART_SR_TXE);    	//return 1 if TX buffer is empty
}

//print to uart3
void u3Print(char *str, int32_t dat) {
	static char uRAM[uRAM_SIZE];						//transmission buffer, 40-1 char max
	
	strcpy(uRAM, str);					//copy to uarm
	uPrint(uRAM, dat);					//print to uRAM
	uart3Puts(uRAM);					//send a message on uart1
}	
#endif		//USART3


#if defined(USART4)
//uart4
//initialize usart: high baudrate (brgh=1), 16-bit baudrate (brg16=1)
//baudrate=Fxtal/(4*(spbrg+1))
//spbrg=(Fxtal/4/baudrate)-1
//tx/rx pins to be assumed in gpio mode
//data bits: 	8
//parity: 		none
//stop bits: 	1
//Xon/Xoff:		none
void uart4Init(unsigned long baudrate) {
	//uint16_t uartdiv;

	//configure uart1
    //route clock to uart1
    RCC->APBENR1 |= RCC_APBENR1_USART4EN;

	//reset usart
	uartInit(USART4, baudrate);

    //configure the TX-PA9/RX-PA10 pins - GPIO clock assumed enabled here previously
    //RX as floating input/AF input, AF1
    //IO_INFL(GPIOA, 1<<10); GPIOA->AFR[1] = (GPIOA->AFR[1] &~(0x0f << (4 * (10-8)))) | (1<<(4 * (10-8)));
	//TX as AFPP, AF1
    //IO_AFPP(GPIOA, 1<< 9); GPIOA->AFR[1] = (GPIOA->AFR[1] &~(0x0f << (4 * ( 9-8)))) | (1<<(4 * ( 9-8)));
#if defined(U2TX2PIN)
    U2TX2PIN();
#endif
#if defined(U2RX2PIN)
    U2RX2PIN();
#endif


}

void uart4Putch(char ch) {
	   //while (!(USART4->SR & USART_SR_TXE));    	//wait for the transmission buffer to be empty
	    while (uart4Busy()) continue;    			//wait for the transmission buffer to be empty
	    USART4->DR = ch;                        	//load the data buffer
	    //while (!(USART4->SR & (1<<6)));    		//wait for the transmission to complete
}

void uart4Puts(char *str) {
	while (*str) uart4Putch(*str++);
}

/*

Writes a line of text to USART and goes to new line
The new line is Windows style CR/LF pair.

This will work on Hyper Terminal Only NOT on Linux

*/

void uart4Putline(char *ln) {
	//USARTWriteString(ln);
	uart4Puts(ln);
	//USARTWriteString("\r\n");
	uart4Puts((char *)"\r\n");
}

uint8_t uart4Getch(void) {
	   //while (!(USART4->SR & USART_SR_RXNE));  	//wait for the receipt buffer to be empty
	    return USART4->DR;                       	//save the transmission buffer
}

//test if data rx is available
uint16_t uart4Available(void) {
	//return (USART4->SR & USART_SR_TC)?true:false;
	return (USART4->SR & USART_SR_RXNE);
}

//test if uart tx is busy
uint16_t uart4Busy(void) {
	   return !(USART4->SR & USART_SR_TXE);    	//return 1 if TX buffer is empty
}

//print to uart4
void u4Print(char *str, int32_t dat) {
	static char uRAM[uRAM_SIZE];						//transmission buffer, 40-1 char max
	
	strcpy(uRAM, str);					//copy to uarm
	uPrint(uRAM, dat);					//print to uRAM
	uart4Puts(uRAM);					//send a message on uart1
}	
#endif		//USART4
//end Serial

//timer generic reset routine, to save space
void tmrInit(TIM_TypeDef *TIMx, uint16_t ps) {
	//source from internal clock -> disable slave mode
	TIMx->SMCR &=~TIM_SMCR_SMS;			//clear sms->use internal clock

	//stop the timer to configure it
	TIMx->CR1 &=~TIM_CR1_CEN;			//clear cen. 0=disable the timer, 1=enable the timer
	TIMx->CR1 &=~TIM_CR1_CKD;			//clear CKD0..1. 0b00->1x clock; 0b01->2:1 clock, 0b10->4:1 clk; 0b11->reserved
	TIMx->CR1 &=~TIM_CR1_DIR;			//clear DIR bit. 0=upcounter, 1=downcounter
	TIMx->CR1 &=~TIM_CR1_OPM;			//clear opm bit. 0=periodic timer, 1=one-shot timer
	//or to simply zero the register
	//TIMx->CR1 = 0;						//much easier

	//clear the status register bits for capture / compare flags
	TIMx->SR &=~(TIM_SR_UIF | TIM_SR_CC1IF | TIM_SR_CC2IF | TIM_SR_CC3IF | TIM_SR_CC4IF);
	//disable the interrupt by clearing the enable bits
	TIMx->DIER &=~(TIM_DIER_UIE | TIM_DIER_CC1IE | TIM_DIER_CC2IE | TIM_DIER_CC3IE | TIM_DIER_CC4IE);

	//set the prescaler
	TIMx->PSC = ps - 1;			//set the prescaler
	TIMx->RCR = 0;						//repetition counter = 0 (=no repetition)
	TIMx->ARR = (uint32_t) -1;			//auto reload register / period = 0; - need to change for downcounters
	TIMx->CNT = 0;						//reset the counter
	TIMx->CCR1= TIMx->CCR2= TIMx->CCR3= TIMx->CCR4= 0;				//reset CCRn

	//enable the timer.
	TIMx->CR1 |= TIM_CR1_CEN;			//enable the timer
}

//tmr1
//global variables
static void (* _tim1_ovfisrptr)(void)=empty_handler;				//tim1_ptr pointing to empty_handler by default
static void (* _tim1_cc1isrptr)(void)=empty_handler;				//tim1_ptr pointing to empty_handler by default
static void (* _tim1_cc2isrptr)(void)=empty_handler;				//tim1_ptr pointing to empty_handler by default
static void (* _tim1_cc3isrptr)(void)=empty_handler;				//tim1_ptr pointing to empty_handler by default
static void (* _tim1_cc4isrptr)(void)=empty_handler;				//tim1_ptr pointing to empty_handler by default

static uint16_t _tim1_cc1=0;				//output compare registers
static uint16_t _tim1_cc2=0;
static uint16_t _tim1_cc3=0;
static uint16_t _tim1_cc4=0;

