dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.c
//isr for timer1 ovf
void TIM1_BRK_UP_TRG_COM_IRQHandler(void) {
	//tmr1 ovf isr
	if (TIM1->SR & TIM_SR_UIF) {TIM1->SR &=~TIM_SR_UIF; _tim1_ovfisrptr();}
}


//isr for timer1 capture / compare
void TIM1_CC_IRQHandler(void) {
	//oc1..4 portion
	//output compare 1 flag is set
	//clear the flag, update the output compare register, execute user handler
	if ((TIM1->SR & TIM_SR_CC1IF) && (TIM1->DIER & TIM_DIER_CC1IE)) {TIM1->SR &=~TIM_SR_CC1IF; if (TIM1->CCER & TIM_CCER_CC1E) _tim1_cc1 = TIM1->CCR1; else TIM1->CCR1 += _tim1_cc1; _tim1_cc1isrptr();}
	if ((TIM1->SR & TIM_SR_CC2IF) && (TIM1->DIER & TIM_DIER_CC2IE)) {TIM1->SR &=~TIM_SR_CC2IF; if (TIM1->CCER & TIM_CCER_CC2E) _tim1_cc2 = TIM1->CCR2; else TIM1->CCR2 += _tim1_cc2; _tim1_cc2isrptr();}
	if ((TIM1->SR & TIM_SR_CC3IF) && (TIM1->DIER & TIM_DIER_CC3IE)) {TIM1->SR &=~TIM_SR_CC3IF; if (TIM1->CCER & TIM_CCER_CC3E) _tim1_cc3 = TIM1->CCR3; else TIM1->CCR3 += _tim1_cc3; _tim1_cc3isrptr();}
	if ((TIM1->SR & TIM_SR_CC4IF) && (TIM1->DIER & TIM_DIER_CC4IE)) {TIM1->SR &=~TIM_SR_CC4IF; if (TIM1->CCER & TIM_CCER_CC4E) _tim1_cc4 = TIM1->CCR4; else TIM1->CCR4 += _tim1_cc4; _tim1_cc4isrptr();}
}

//initialize the timer1 (16bit)
void tmr1Init(uint16_t ps) {
	//route the clock to timer
	RCC->APBENR2 |= RCC_APBENR2_TIM1EN;

	//reset timer
	tmrInit(TIM1, ps);
}


//activate the ovf isr handler
void tmr1OVFAttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM1_BRK_UP_TRG_COM_IRQn);		//disable irq

	_tim1_ovfisrptr = isrptr;			//install user handler

	//clear the flag
	TIM1->SR &=~TIM_SR_UIF;				//clear the interrupt flag
	TIM1->DIER |= TIM_DIER_UIE;			//enable the isr

	NVIC_EnableIRQ(TIM1_BRK_UP_TRG_COM_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//set tim1_cc1 period
//pr is 16-bit. 32-bit used for compatability;
void tmr1OC1SetPR(uint16_t pr) {
	//save the period value
	_tim1_cc1 = pr - 0;
	TIM1->CCR1 = _tim1_cc1;

	//clear the flag
	//TIM1->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM1->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//activate the isr handler
void tmr1OC1AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM1_CC_IRQn);		//disable irq

	_tim1_cc1isrptr = isrptr;			//install user handler

	//clear the flag
	TIM1->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	TIM1->DIER |= TIM_DIER_CC1IE;		//enable the isr

	NVIC_EnableIRQ(TIM1_CC_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//set tim1_cc1 period
//pr is 16-bit. 32-bit used for compatability;
void tmr1OC2SetPR(uint16_t pr) {
	//save the period value
	_tim1_cc2 = pr - 0;
	TIM1->CCR2 = _tim1_cc2;

	//clear the flag
	//TIM1->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM1->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//activate the isr handler
void tmr1OC2AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM1_CC_IRQn);		//disable irq

	_tim1_cc2isrptr = isrptr;			//install user handler

	//clear the flag
	TIM1->SR &=~TIM_SR_CC2IF;			//clear the interrupt flag
	TIM1->DIER |= TIM_DIER_CC2IE;		//enable the isr

	NVIC_EnableIRQ(TIM1_CC_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//set tim1_cc1 period
//pr is 16-bit. 32-bit used for compatability;
void tmr1OC3SetPR(uint16_t pr) {
	//save the period value
	_tim1_cc3 = pr - 0;
	TIM1->CCR3 = _tim1_cc3;

	//clear the flag
	//TIM1->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM1->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//activate the isr handler
void tmr1OC3AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM1_CC_IRQn);		//disable irq

	_tim1_cc3isrptr = isrptr;			//install user handler

	//clear the flag
	TIM1->SR &=~TIM_SR_CC3IF;			//clear the interrupt flag
	TIM1->DIER |= TIM_DIER_CC3IE;		//enable the isr

	NVIC_EnableIRQ(TIM1_CC_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//set tim1_cc1 period
//pr is 16-bit. 32-bit used for compatability;
void tmr1OC4SetPR(uint16_t pr) {
	//save the period value
	_tim1_cc4 = pr - 0;
	TIM1->CCR4 = _tim1_cc4;

	//clear the flag
	//TIM1->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM1->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//activate the isr handler
void tmr1OC4AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM1_CC_IRQn);		//disable irq

	_tim1_cc4isrptr = isrptr;			//install user handler

	//clear the flag
	TIM1->SR &=~TIM_SR_CC4IF;			//clear the interrupt flag
	TIM1->DIER |= TIM_DIER_CC4IE;		//enable the isr

	NVIC_EnableIRQ(TIM1_CC_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//ic1
void tmr1IC1Init(uint8_t ps) {
	//set up the capture channel 1
	TIM1->CCMR1 = (TIM1->CCMR1 &~TIM_CCMR1_CC1S) | (TIM_CCMR1_CC1S_0);	//0b01->input capture
	TIM1->CCMR1 = (TIM1->CCMR1 &~TIM_CCMR1_IC1PSC) | ((ps<<TIM_CCMR1_IC1PSC_Pos) & TIM_CCMR1_IC1PSC);	//INPUT prescaler: 0->1:1
	//clear the flag and disable the interrupt
	TIM1->SR &=~TIM_SR_CC1IF; TIM1->DIER &=~TIM_DIER_CC1IE;	//CLEAR_BIT the interrupt flag and disable the interrupt
	TIM1->CCER |= TIM_CCER_CC1E;							//1->ENABLE input capture, 0->disable ic 
	//map TIM1 rmp to MCO (=3)
	//TIM1->OR = (TIM1->OR &~TIM1_OR_TI1_RMP) | (((3) << 0) & TIM1_OR_TI1_RMP);	//0->gpio, 1->rtcclk, 2->hse/32, 3->mco
	//TIM1->EGR |=TIM_EGR_UG;								//force an update

#if defined(TIM1CH1toPIN)
	TIM1CH1toPIN();											//configure the input capture pin
#endif	//ch1
}

//activate the isr handler
void tmr1IC1AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM1_CC_IRQn);		//disable irq

	_tim1_cc1isrptr = isrptr;			//install user handler

	//clear the flag
	TIM1->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	TIM1->DIER |= TIM_DIER_CC1IE;		//enable the isr

	NVIC_EnableIRQ(TIM1_CC_IRQn);		//enable irq
	//priorities not set -> default values used.

}

//ic2
void tmr1IC2Init(uint8_t ps) {
	//set up the capture channel 1
	TIM1->CCMR1 = (TIM1->CCMR1 &~TIM_CCMR1_CC2S) | (TIM_CCMR1_CC2S_0);	//0b01->input capture
	TIM1->CCMR1 = (TIM1->CCMR1 &~TIM_CCMR1_IC2PSC) | ((ps<<TIM_CCMR1_IC2PSC_Pos) & TIM_CCMR1_IC2PSC);	//INPUT prescaler: 0->1:1
	//clear the flag and disable the interrupt
	TIM1->SR &=~TIM_SR_CC2IF; TIM1->DIER &=~TIM_DIER_CC2IE;	//CLEAR_BIT the interrupt flag and disable the interrupt
	TIM1->CCER |= TIM_CCER_CC2E;							//1->ENABLE input capture, 0->disable ic 
	//map TIM1 rmp to MCO (=3)
	//TIM1->OR = (TIM1->OR &~TIM1_OR_TI1_RMP) | (((3) << 0) & TIM1_OR_TI1_RMP);	//0->gpio, 1->rtcclk, 2->hse/32, 3->mco
	//TIM1->EGR |=TIM_EGR_UG;								//force an update

#if defined(TIM1CH2toPIN)
	TIM1CH2toPIN();											//configure the input capture pin
#endif	//ch2
}

//activate the isr handler
void tmr1IC2AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM1_CC_IRQn);		//disable irq

	_tim1_cc2isrptr = isrptr;			//install user handler

	//clear the flag
	TIM1->SR &=~TIM_SR_CC2IF;			//clear the interrupt flag
	TIM1->DIER |= TIM_DIER_CC2IE;		//enable the isr

	NVIC_EnableIRQ(TIM1_CC_IRQn);		//enable irq
	//priorities not set -> default values used.

