dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.c
}

//ic3
void tmr1IC3Init(uint8_t ps) {
	//set up the capture channel 1
	TIM1->CCMR2 = (TIM1->CCMR2 &~TIM_CCMR2_CC3S) | (TIM_CCMR2_CC3S_0);	//0b01->input capture
	TIM1->CCMR2 = (TIM1->CCMR2 &~TIM_CCMR2_IC3PSC) | ((ps<<TIM_CCMR2_IC3PSC_Pos) & TIM_CCMR2_IC3PSC);	//INPUT prescaler: 0->1:1
	//clear the flag and disable the interrupt
	TIM1->SR &=~TIM_SR_CC3IF; TIM1->DIER &=~TIM_DIER_CC3IE;	//CLEAR_BIT the interrupt flag and disable the interrupt
	TIM1->CCER |= TIM_CCER_CC3E;							//1->ENABLE input capture, 0->disable ic 
	//map TIM1 rmp to MCO (=3)
	//TIM1->OR = (TIM1->OR &~TIM1_OR_TI1_RMP) | (((3) << 0) & TIM1_OR_TI1_RMP);	//0->gpio, 1->rtcclk, 2->hse/32, 3->mco
	//TIM1->EGR |=TIM_EGR_UG;								//force an update

#if defined(TIM1CH3toPIN)
	TIM1CH3toPIN();											//configure the input capture pin
#endif	//ch3
}

//activate the isr handler
void tmr1IC3AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM1_CC_IRQn);		//disable irq

	_tim1_cc3isrptr = isrptr;			//install user handler

	//clear the flag
	TIM1->SR &=~TIM_SR_CC3IF;			//clear the interrupt flag
	TIM1->DIER |= TIM_DIER_CC3IE;		//enable the isr

	NVIC_EnableIRQ(TIM1_CC_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//ic4
void tmr1IC4Init(uint8_t ps) {
	//set up the capture channel 1
	TIM1->CCMR2 = (TIM1->CCMR2 &~TIM_CCMR2_CC4S) | (TIM_CCMR2_CC4S_0);	//0b01->input capture
	TIM1->CCMR2 = (TIM1->CCMR2 &~TIM_CCMR2_IC4PSC) | ((ps<<TIM_CCMR2_IC4PSC_Pos) & TIM_CCMR2_IC4PSC);	//INPUT prescaler: 0->1:1
	//clear the flag and disable the interrupt
	TIM1->SR &=~TIM_SR_CC4IF; TIM1->DIER &=~TIM_DIER_CC4IE;	//CLEAR_BIT the interrupt flag and disable the interrupt
	TIM1->CCER |= TIM_CCER_CC4E;							//1->ENABLE input capture, 0->disable ic 
	//map TIM1 rmp to MCO (=3)
	//TIM1->OR = (TIM1->OR &~TIM1_OR_TI1_RMP) | (((3) << 0) & TIM1_OR_TI1_RMP);	//0->gpio, 1->rtcclk, 2->hse/32, 3->mco
	//TIM1->EGR |=TIM_EGR_UG;								//force an update

#if defined(TIM1CH4toPIN)
	TIM1CH4toPIN();											//configure the input capture pin
#endif	//ch4
}

//activate the isr handler
void tmr1IC4AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM1_CC_IRQn);		//disable irq

	_tim1_cc4isrptr = isrptr;			//install user handler

	//clear the flag
	TIM1->SR &=~TIM_SR_CC4IF;			//clear the interrupt flag
	TIM1->DIER |= TIM_DIER_CC4IE;		//enable the isr

	NVIC_EnableIRQ(TIM1_CC_IRQn);		//enable irq
	//priorities not set -> default values used.
}

#if defined(TIM2)						//TIM2 does not exist on PY32
//tmr2
//global variables
static void (* _tim2_ovfisrptr)(void)=empty_handler;				//TIM2_ptr pointing to empty_handler by default
static void (* _tim2_cc1isrptr)(void)=empty_handler;				//TIM2_ptr pointing to empty_handler by default
static void (* _tim2_cc2isrptr)(void)=empty_handler;				//TIM2_ptr pointing to empty_handler by default
static void (* _tim2_cc3isrptr)(void)=empty_handler;				//TIM2_ptr pointing to empty_handler by default
static void (* _tim2_cc4isrptr)(void)=empty_handler;				//TIM2_ptr pointing to empty_handler by default

static uint16_t _tim2_cc1=0;				//output compare registers
static uint16_t _tim2_cc2=0;
static uint16_t _tim2_cc3=0;
static uint16_t _tim2_cc4=0;

//isr for timer1 capture / compare
void TIM2_IRQHandler(void) {
	//oc1 portion
	if (TIM2->SR & TIM_SR_CC1IF) {TIM2->SR &=~TIM_SR_CC1IF; if (TIM2->CCER & TIM_CCER_CC1E) _tim2_cc1 = TIM2->CCR1; else TIM2->CCR1 += _tim2_cc1; _tim2_cc1isrptr();}
	if (TIM2->SR & TIM_SR_CC2IF) {TIM2->SR &=~TIM_SR_CC2IF; if (TIM2->CCER & TIM_CCER_CC2E) _tim2_cc2 = TIM2->CCR2; else TIM2->CCR2 += _tim2_cc2; _tim2_cc2isrptr();}
	if (TIM2->SR & TIM_SR_CC3IF) {TIM2->SR &=~TIM_SR_CC3IF; if (TIM2->CCER & TIM_CCER_CC3E) _tim2_cc3 = TIM2->CCR3; else TIM2->CCR3 += _tim2_cc3; _tim2_cc3isrptr();}
	if (TIM2->SR & TIM_SR_CC4IF) {TIM2->SR &=~TIM_SR_CC4IF; if (TIM2->CCER & TIM_CCER_CC4E) _tim2_cc4 = TIM2->CCR4; else TIM2->CCR4 += _tim2_cc4; _tim2_cc4isrptr();}

	//overflow isr
	if (TIM2->SR & TIM_SR_UIF) {TIM2->SR &=~TIM_SR_UIF; _tim2_ovfisrptr();}
}

//initialize the timer1 (16bit)
void tmr2Init(uint16_t ps) {
	//route the clock to timer
	RCC->APBENR1 |= RCC_APBENR1_TIM2EN;

	//reset timer
	tmrInit(TIM2, ps);
}

//activate the isr handler
void tmr2OVFAttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM2_IRQn);			//disable irq

	_tim2_ovfisrptr = isrptr;			//install user handler

	//clear the flag
	TIM2->SR &=~TIM_SR_UIF;			//clear the interrupt flag
	TIM2->DIER |= TIM_DIER_UIE;		//enable the isr

	NVIC_EnableIRQ(TIM2_IRQn);			//enable irq
	//priorities not set -> default values used.
}

//set TIM2_cc1 period
//pr is 16-bit. 32-bit used for compatability;
void tmr2OC1SetPR(uint16_t pr) {
	//save the period value
	_tim2_cc1 = pr - 0;
	TIM2->CCR1 = _tim2_cc1;

	//clear the flag
	//TIM2->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM2->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//activate the isr handler
void tmr2OC1AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM2_IRQn);			//disable irq

	_tim2_cc1isrptr = isrptr;			//install user handler

	//clear the flag
	TIM2->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	TIM2->DIER |= TIM_DIER_CC1IE;		//enable the isr

	NVIC_EnableIRQ(TIM2_IRQn);			//enable irq
	//priorities not set -> default values used.
}

//set TIM2_cc1 period
//pr is 16-bit. 32-bit used for compatability;
void tmr2OC2SetPR(uint16_t pr) {
	//save the period value
	_tim2_cc2 = pr - 0;
	TIM2->CCR2 = _tim2_cc2;

	//clear the flag
	//TIM2->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM2->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//activate the isr handler
void tmr2OC2AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM2_IRQn);			//disable irq

	_tim2_cc2isrptr = isrptr;			//install user handler

	//clear the flag
	TIM2->SR &=~TIM_SR_CC2IF;			//clear the interrupt flag
	TIM2->DIER |= TIM_DIER_CC2IE;		//enable the isr

	NVIC_EnableIRQ(TIM2_IRQn);			//enable irq
	//priorities not set -> default values used.
}

//set TIM2_cc1 period
//pr is 16-bit. 32-bit used for compatability;
void tmr2OC3SetPR(uint16_t pr) {
	//save the period value
	_tim2_cc3 = pr - 0;
	TIM2->CCR3 = _tim2_cc3;

	//clear the flag
	//TIM2->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM2->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//activate the isr handler
void tmr2OC3AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM2_IRQn);			//disable irq

	_tim2_cc3isrptr = isrptr;			//install user handler

	//clear the flag
	TIM2->SR &=~TIM_SR_CC3IF;			//clear the interrupt flag
	TIM2->DIER |= TIM_DIER_CC3IE;		//enable the isr

	NVIC_EnableIRQ(TIM2_IRQn);			//enable irq
	//priorities not set -> default values used.
}

//set TIM2_cc1 period
//pr is 16-bit. 32-bit used for compatability;
void tmr2OC4SetPR(uint16_t pr) {
	//save the period value
	_tim2_cc4 = pr - 0;
	TIM2->CCR4 = _tim2_cc4;

	//clear the flag
	//TIM2->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM2->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//activate the isr handler
void tmr2OC4AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM2_IRQn);			//disable irq

	_tim2_cc4isrptr = isrptr;			//install user handler

	//clear the flag
	TIM2->SR &=~TIM_SR_CC4IF;			//clear the interrupt flag
	TIM2->DIER |= TIM_DIER_CC4IE;		//enable the isr

	NVIC_EnableIRQ(TIM2_IRQn);			//enable irq
	//priorities not set -> default values used.
}

//ic1
void tmr2IC1Init(uint8_t ps) {
	//set up the capture channel 1
	TIM2->CCMR1 = (TIM2->CCMR1 &~TIM_CCMR1_CC1S) | (TIM_CCMR1_CC1S_0);	//0b01->input capture
	TIM2->CCMR1 = (TIM2->CCMR1 &~TIM_CCMR1_IC1PSC) | ((ps<<TIM_CCMR1_IC1PSC_Pos) & TIM_CCMR1_IC1PSC);	//INPUT prescaler: 0->1:1
	//clear the flag and disable the interrupt
	TIM2->SR &=~TIM_SR_CC1IF; TIM2->DIER &=~TIM_DIER_CC1IE;	//CLEAR_BIT the interrupt flag and disable the interrupt
	TIM2->CCER |= TIM_CCER_CC1E;							//1->ENABLE input capture, 0->disable ic 
	//map TIM2 rmp to MCO (=3)
	//TIM2->OR = (TIM2->OR &~TIM2_OR_TI1_RMP) | (((3) << 0) & TIM2_OR_TI1_RMP);	//0->gpio, 1->rtcclk, 2->hse/32, 3->mco
	//TIM2->EGR |=TIM_EGR_UG;								//force an update

