dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.c
	NVIC_EnableIRQ(TIM3_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//ic4
void tmr3IC4Init(uint8_t ps) {
	//set up the capture channel 1
	TIM3->CCMR2 = (TIM3->CCMR2 &~TIM_CCMR2_CC4S) | (TIM_CCMR2_CC4S_0);	//0b01->input capture
	TIM3->CCMR2 = (TIM3->CCMR2 &~TIM_CCMR2_IC4PSC) | ((ps<<TIM_CCMR2_IC4PSC_Pos) & TIM_CCMR2_IC4PSC);	//INPUT prescaler: 0->1:1
	//clear the flag and disable the interrupt
	TIM3->SR &=~TIM_SR_CC4IF; TIM3->DIER &=~TIM_DIER_CC4IE;	//CLEAR_BIT the interrupt flag and disable the interrupt
	TIM3->CCER |= TIM_CCER_CC4E;							//1->ENABLE input capture, 0->disable ic 
	//map TIM3 rmp to MCO (=3)
	//TIM3->OR = (TIM3->OR &~TIM3_OR_TI1_RMP) | (((3) << 0) & TIM3_OR_TI1_RMP);	//0->gpio, 1->rtcclk, 2->hse/32, 3->mco
	//TIM3->EGR |=TIM_EGR_UG;								//force an update

#if defined(TIM3CH4toPIN)
	TIM3CH4toPIN();											//configure the input capture pin
#endif	//ch4
}

//activate the isr handler
void tmr3IC4AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM3_IRQn);		//disable irq

	_tim3_cc4isrptr = isrptr;			//install user handler

	//clear the flag
	TIM3->SR &=~TIM_SR_CC4IF;			//clear the interrupt flag
	TIM3->DIER |= TIM_DIER_CC4IE;		//enable the isr

	NVIC_EnableIRQ(TIM3_IRQn);		//enable irq
	//priorities not set -> default values used.
}

#endif	//tim3

#if defined(TIM6)		//TiM6 only available in x8 devices
//tim6
//global variables
static void (* _tim6_ovfisrptr)(void)=empty_handler;				//TIM6_ptr pointing to empty_handler by default
static void (* _tim6_cc1isrptr)(void)=empty_handler;				//TIM6_ptr pointing to empty_handler by default
static void (* _tim6_cc2isrptr)(void)=empty_handler;				//TIM6_ptr pointing to empty_handler by default

static uint16_t _tim6_cc1=0;				//output compare registers
static uint16_t _tim6_cc2=0;

//isr for timer1 capture / compare
void TIM6_IRQHandler(void) {
	//oc1 portion
	if (TIM6->SR & TIM_SR_CC1IF) {TIM6->SR &=~TIM_SR_CC1IF; if (TIM6->CCER & TIM_CCER_CC1E) _TIM6_cc1 = TIM6->CCR1; else TIM6->CCR1 += _tim6_cc1; _tim6_cc1isrptr();}
	if (TIM6->SR & TIM_SR_CC2IF) {TIM6->SR &=~TIM_SR_CC2IF; if (TIM6->CCER & TIM_CCER_CC2E) _TIM6_cc2 = TIM6->CCR2; else TIM6->CCR2 += _tim6_cc2; _tim6_cc2isrptr();}
	//if (TIM6->SR & TIM_SR_CC3IF) {TIM6->SR &=~TIM_SR_CC3IF; if (TIM6->CCER & TIM_CCER_CC3E) _TIM6_cc3 = TIM6->CCR3; else TIM6->CCR3 += _tim6_cc3; _tim6_cc3isrptr();}
	//if (TIM6->SR & TIM_SR_CC4IF) {TIM6->SR &=~TIM_SR_CC4IF; if (TIM6->CCER & TIM_CCER_CC4E) _TIM6_cc4 = TIM6->CCR4; else TIM6->CCR4 += _tim6_cc4; _tim6_cc4isrptr();}

	//overflow isr
	if (TIM6->SR & TIM_SR_UIF) {TIM6->SR &=~TIM_SR_UIF; _tim3_ovfisrptr();}
}

//initialize the timer1 (16bit)
void tmr6Init(uint16_t ps) {
	//route the clock to timer
	RCC->APB1ENR |= RCC_APB1ENR_TIM6EN;

	//reset timer
	tmrInit(TIM6, ps);
}

//activate the isr handler
void tmr6OVFAttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM6_IRQn);			//disable irq

	_tim6_ovfisrptr = isrptr;			//install user handler

	//clear the flag
	TIM6->SR &=~TIM_SR_UIF;			//clear the interrupt flag
	TIM6->DIER |= TIM_DIER_UIE;		//enable the isr

	NVIC_EnableIRQ(TIM6_IRQn);			//enable irq
	//priorities not set -> default values used.
}
#endif	//tim6

#if defined(TIM14)
//tim14
//global variables
static void (* _tim14_ovfisrptr)(void)=empty_handler;				//tim4_ptr pointing to empty_handler by default
static void (* _tim14_cc1isrptr)(void)=empty_handler;				//tim4_ptr pointing to empty_handler by default
static void (* _tim14_cc2isrptr)(void)=empty_handler;				//tim4_ptr pointing to empty_handler by default
//static void (* _tim14_cc3isrptr)(void)=empty_handler;				//tim4_ptr pointing to empty_handler by default
//static void (* _tim14_cc4isrptr)(void)=empty_handler;				//tim4_ptr pointing to empty_handler by default
static uint16_t _tim14_cc1=0;				//output compare registers
static uint16_t _tim14_cc2=0;
//static uint16_t _tim14_cc3=0;
//static uint16_t _tim14_cc4=0;

//isr for timer14
void TIM14_IRQHandler(void) {
	//capture / compare 1portion
	if ((TIM14->SR & TIM_SR_CC1IF) && (TIM14->DIER & TIM_DIER_CC1IE)) {TIM14->SR &=~TIM_SR_CC1IF; if (TIM14->CCER & TIM_CCER_CC1E) _tim14_cc1 = TIM14->CCR1; else TIM14->CCR1 += _tim14_cc1; _tim14_cc1isrptr();}
	if ((TIM14->SR & TIM_SR_CC2IF) && (TIM14->DIER & TIM_DIER_CC2IE)) {TIM14->SR &=~TIM_SR_CC2IF; if (TIM14->CCER & TIM_CCER_CC2E) _tim14_cc2 = TIM14->CCR2; else TIM14->CCR2 += _tim14_cc2; _tim14_cc2isrptr();}
	//if ((TIM14->SR & TIM_SR_CC3IF) && (TIM14->DIER & TIM_DIER_CC3IE)) {TIM14->SR &=~TIM_SR_CC3IF; if (TIM14->CCER & TIM_CCER_CC3E) _tim14_cc3 = TIM14->CCR3; else TIM14->CCR3 += _tim14_cc3; _tim14_cc3isrptr();}
	//if ((TIM14->SR & TIM_SR_CC4IF) && (TIM14->DIER & TIM_DIER_CC4IE)) {TIM14->SR &=~TIM_SR_CC4IF; if (TIM14->CCER & TIM_CCER_CC4E) _tim14_cc4 = TIM14->CCR4; else TIM14->CCR4 += _tim14_cc4; _tim14_cc4isrptr();}

	//overflow isr
	if (TIM14->SR & TIM_SR_UIF) {TIM14->SR &=~TIM_SR_UIF; _tim14_ovfisrptr();}
}

//initialize tim4 to use compare channels as timers
//16-bit prescaler. 32-bit used for compatability
void tmr14Init(uint16_t ps) {
	//route the clock to timer
	RCC->APBENR2 |= RCC_APBENR2_TIM14EN;

	//reset timer
	tmrInit(TIM14, ps);
}

//install user handler
void tmr14OVFAttachISR(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(TIM14_IRQn);		//disable irq

	_tim14_ovfisrptr = isr_ptr;			//install user handler

	//clear the flag
	TIM14->SR &=~TIM_SR_UIF;			//clear the interrupt flag
	TIM14->DIER |= TIM_DIER_UIE;		//enable the isr

	NVIC_EnableIRQ(TIM14_IRQn);			//enable irq
	//priorities not set -> default values used.
}

//set TIM14_cc1 period
//pr is 16-bit. 32-bit used for compatability;
void tmr14OC1SetPR(uint16_t pr) {
	//save the period value
	_tim14_cc1 = pr - 0;
	TIM14->CCR1 = _tim14_cc1;

	//clear the flag
	//TIM3->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM3->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//activate the isr handler
void tmr14OC1AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM14_IRQn);			//disable irq

	_tim14_cc1isrptr = isrptr;			//install user handler

	//clear the flag
	TIM14->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	TIM14->DIER |= TIM_DIER_CC1IE;		//enable the isr

