dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.c
	NVIC_EnableIRQ(TIM14_IRQn);			//enable irq
	//priorities not set -> default values used.
}

//ic1
void tmr14IC1Init(uint8_t ps) {
	//set up the capture channel 1
	TIM14->CCMR1 = (TIM14->CCMR1 &~TIM_CCMR1_CC1S) | (TIM_CCMR1_CC1S_0);	//0b01->input capture
	TIM14->CCMR1 = (TIM14->CCMR1 &~TIM_CCMR1_IC1PSC) | ((ps<<TIM_CCMR1_IC1PSC_Pos) & TIM_CCMR1_IC1PSC);	//INPUT prescaler: 0->1:1
	//clear the flag and disable the interrupt
	TIM14->SR &=~TIM_SR_CC1IF; TIM14->DIER &=~TIM_DIER_CC1IE;	//CLEAR_BIT the interrupt flag and disable the interrupt
	TIM14->CCER |= TIM_CCER_CC1E;							//1->ENABLE input capture, 0->disable ic 
	//map TIM14 rmp to MCO (=3)
	//TIM14->OR = (TIM14->OR &~TIM14_OR_TI1_RMP) | (((3) << 0) & TIM14_OR_TI1_RMP);	//0->gpio, 1->rtcclk, 2->hse/32, 3->mco
	//TIM14->EGR |=TIM_EGR_UG;								//force an update

#if defined(TIM14CH1toPIN)
	TIM14CH1toPIN();											//configure the input capture pin
#endif	//ch1
}

//activate the isr handler
void tmr14IC1AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM14_IRQn);		//disable irq

	_tim14_cc1isrptr = isrptr;			//install user handler

	//clear the flag
	TIM14->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	TIM14->DIER |= TIM_DIER_CC1IE;		//enable the isr

	NVIC_EnableIRQ(TIM14_IRQn);		//enable irq
	//priorities not set -> default values used.
}

#endif		//tim14

#if defined(TIM15)
//tim15
//global variables
static void (* _tim15_ovfisrptr)(void)=empty_handler;				//tim4_ptr pointing to empty_handler by default
static void (* _tim15_cc1isrptr)(void)=empty_handler;				//tim4_ptr pointing to empty_handler by default
static void (* _tim15_cc2isrptr)(void)=empty_handler;				//tim4_ptr pointing to empty_handler by default
static uint16_t _tim15_cc1=0;
static uint16_t _tim15_cc2=0;

//isr for timer1 capture / compare
void TIM15_IRQHandler(void) {
	//cc1 isr
	if ((TIM15->SR & TIM_SR_CC1IF) && (TIM15->DIER & TIM_DIER_CC1IE)) {TIM15->SR &=~TIM_SR_CC1IF; if (TIM15->CCER & TIM_CCER_CC1E) _tim15_cc1 = TIM14->CCR1; else TIM15->CCR1 += _tim15_cc1; _tim15_cc1isrptr();}
	if ((TIM15->SR & TIM_SR_CC2IF) && (TIM15->DIER & TIM_DIER_CC2IE)) {TIM15->SR &=~TIM_SR_CC2IF; if (TIM15->CCER & TIM_CCER_CC2E) _tim15_cc1 = TIM14->CCR2; else TIM15->CCR2 += _tim15_cc2; _tim15_cc2isrptr();}
	
	//ovf isr
	if ((TIM15->SR & TIM_SR_UIF) && (TIM15->DIER & TIM_DIER_UIE)) {TIM15->SR &=~TIM_SR_UIF; _tim15_ovfisrptr();}
}

//initialize tim4 to use compare channels as timers
//16-bit prescaler. 32-bit used for compatability
void tmr15Init(uint16_t ps) {
	//route the clock to timer
	RCC->APB2ENR |= RCC_APB2ENR_TIM15EN;

	//reset timer
	tmrInit(TIM15, ps);
}

//install user handler
void tmr15OVFAttachISR(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(TIM15_IRQn);		//disable irq

	_tim15_ovfisrptr = isr_ptr;			//install user handler

	//clear the flag
	TIM15->SR &=~TIM_SR_UIF;			//clear the interrupt flag
	TIM15->DIER |= TIM_DIER_UIE;		//enable the isr

	NVIC_EnableIRQ(TIM15_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//set TIM15_cc1 period
//pr is 16-bit. 32-bit used for compatability;
void tmr15OC1SetPR(uint16_t pr) {
	//save the period value
	_tim15_cc1 = pr - 0;
	TIM15->CCR1 = _tim15_cc1;

	//clear the flag
	//TIM3->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM3->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//activate the isr handler
void tmr15OC1AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM15_IRQn);			//disable irq

	_tim15_cc1isrptr = isrptr;			//install user handler

	//clear the flag
	TIM15->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	TIM15->DIER |= TIM_DIER_CC1IE;		//enable the isr

	NVIC_EnableIRQ(TIM15_IRQn);			//enable irq
	//priorities not set -> default values used.
}

//set TIM15_cc2 period
//pr is 16-bit. 32-bit used for compatability;
void tmr15OC2SetPR(uint16_t pr) {
	//save the period value
	_tim15_cc2 = pr - 0;
	TIM15->CCR2 = _tim15_cc2;

	//clear the flag
	//TIM3->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM3->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//activate the isr handler
void tmr15OC2AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM15_IRQn);			//disable irq

	_tim15_cc2isrptr = isrptr;			//install user handler

	//clear the flag
	TIM15->SR &=~TIM_SR_CC2IF;			//clear the interrupt flag
	TIM15->DIER |= TIM_DIER_CC2IE;		//enable the isr

	NVIC_EnableIRQ(TIM15_IRQn);			//enable irq
	//priorities not set -> default values used.
}


//ic1
void tmr15IC1Init(uint8_t ps) {
	//set up the capture channel 1
	TIM15->CCMR1 = (TIM15->CCMR1 &~TIM_CCMR1_CC1S) | (TIM_CCMR1_CC1S_0);	//0b01->input capture
	TIM15->CCMR1 = (TIM15->CCMR1 &~TIM_CCMR1_IC1PSC) | ((ps<<TIM_CCMR1_IC1PSC_Pos) & TIM_CCMR1_IC1PSC);	//INPUT prescaler: 0->1:1
	//clear the flag and disable the interrupt
	TIM15->SR &=~TIM_SR_CC1IF; TIM15->DIER &=~TIM_DIER_CC1IE;	//CLEAR_BIT the interrupt flag and disable the interrupt
	TIM15->CCER |= TIM_CCER_CC1E;							//1->ENABLE input capture, 0->disable ic 
	//map TIM15 rmp to MCO (=3)
	//TIM15->OR = (TIM15->OR &~TIM15_OR_TI1_RMP) | (((3) << 0) & TIM15_OR_TI1_RMP);	//0->gpio, 1->rtcclk, 2->hse/32, 3->mco
	//TIM15->EGR |=TIM_EGR_UG;								//force an update

#if defined(TIM15CH1toPIN)
	TIM15CH1toPIN();											//configure the input capture pin
#endif	//ch1
}

//activate the isr handler
void tmr15IC1AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM15_IRQn);		//disable irq

	_tim15_cc1isrptr = isrptr;			//install user handler

	//clear the flag
	TIM15->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	TIM15->DIER |= TIM_DIER_CC1IE;		//enable the isr

	NVIC_EnableIRQ(TIM15_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//ic2
void tmr15IC2Init(uint8_t ps) {
	//set up the capture channel 1
	TIM15->CCMR1 = (TIM15->CCMR1 &~TIM_CCMR1_CC2S) | (TIM_CCMR1_CC2S_0);	//0b01->input capture
	TIM15->CCMR1 = (TIM15->CCMR1 &~TIM_CCMR1_IC2PSC) | ((ps<<TIM_CCMR1_IC2PSC_Pos) & TIM_CCMR1_IC2PSC);	//INPUT prescaler: 0->1:1
	//clear the flag and disable the interrupt
	TIM15->SR &=~TIM_SR_CC2IF; TIM15->DIER &=~TIM_DIER_CC2IE;	//CLEAR_BIT the interrupt flag and disable the interrupt
	TIM15->CCER |= TIM_CCER_CC2E;							//1->ENABLE input capture, 0->disable ic 
	//map TIM15 rmp to MCO (=3)
	//TIM15->OR = (TIM15->OR &~TIM15_OR_TI1_RMP) | (((3) << 0) & TIM15_OR_TI1_RMP);	//0->gpio, 1->rtcclk, 2->hse/32, 3->mco
	//TIM15->EGR |=TIM_EGR_UG;								//force an update

