dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.c
#if defined(TIM15CH2toPIN)
	TIM15CH2toPIN();											//configure the input capture pin
#endif	//ch2
}

//activate the isr handler
void tmr15IC2AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM15_IRQn);		//disable irq

	_tim15_cc2isrptr = isrptr;			//install user handler

	//clear the flag
	TIM15->SR &=~TIM_SR_CC2IF;			//clear the interrupt flag
	TIM15->DIER |= TIM_DIER_CC2IE;		//enable the isr

	NVIC_EnableIRQ(TIM15_IRQn);		//enable irq
	//priorities not set -> default values used.
}
#endif	//tim15

#if defined(TIM16)
//tim16
//global variables
static void (* _tim16_ovfisrptr)(void)=empty_handler;				//tim4_ptr pointing to empty_handler by default
static void (* _tim16_cc1isrptr)(void)=empty_handler;				//tim4_ptr pointing to empty_handler by default
static void (* _tim16_cc2isrptr)(void)=empty_handler;				//tim4_ptr pointing to empty_handler by default
static uint16_t _tim16_cc1=0;
static uint16_t _tim16_cc2=0;

//isr for timer1 capture / compare
void TIM16_IRQHandler(void) {
	//cc1 isr
	if ((TIM16->SR & TIM_SR_CC1IF) && (TIM16->DIER & TIM_DIER_CC1IE)) {TIM16->SR &=~TIM_SR_CC1IF; if (TIM16->CCER & TIM_CCER_CC1E) _tim16_cc1 = TIM16->CCR1; else TIM16->CCR1 += _tim16_cc1; _tim16_cc1isrptr();}
	if ((TIM16->SR & TIM_SR_CC2IF) && (TIM16->DIER & TIM_DIER_CC2IE)) {TIM16->SR &=~TIM_SR_CC2IF; if (TIM16->CCER & TIM_CCER_CC2E) _tim16_cc1 = TIM16->CCR2; else TIM16->CCR2 += _tim16_cc2; _tim16_cc2isrptr();}
	
	//ovf isr
	if ((TIM16->SR & TIM_SR_UIF) && (TIM16->DIER & TIM_DIER_UIE)) {TIM16->SR &=~TIM_SR_UIF; _tim16_ovfisrptr();}
}

//initialize tim4 to use compare channels as timers
//16-bit prescaler. 32-bit used for compatability
void tmr16Init(uint16_t ps) {
	//route the clock to timer
	RCC->APBENR2 |= RCC_APBENR2_TIM16EN;

	//reset timer
	tmrInit(TIM16, ps);
}

//install user handler
void tmr16OVFAttachISR(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(TIM16_IRQn);		//disable irq

	_tim16_ovfisrptr = isr_ptr;			//install user handler

	//clear the flag
	TIM16->SR &=~TIM_SR_UIF;			//clear the interrupt flag
	TIM16->DIER |= TIM_DIER_UIE;		//enable the isr

	NVIC_EnableIRQ(TIM16_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//set TIM16_cc1 period
//pr is 16-bit. 32-bit used for compatability;
void tmr16OC1SetPR(uint16_t pr) {
	//save the period value
	_tim16_cc1 = pr - 0;
	TIM16->CCR1 = _tim16_cc1;

	//clear the flag
	//TIM3->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM3->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//activate the isr handler
void tmr16OC1AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM16_IRQn);			//disable irq

	_tim16_cc1isrptr = isrptr;			//install user handler

	//clear the flag
	TIM16->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	TIM16->DIER |= TIM_DIER_CC1IE;		//enable the isr

	NVIC_EnableIRQ(TIM16_IRQn);			//enable irq
	//priorities not set -> default values used.
}

//set TIM16_cc2 period
//pr is 16-bit. 32-bit used for compatability;
void tmr16OC2SetPR(uint16_t pr) {
	//save the period value
	_tim16_cc2 = pr - 0;
	TIM16->CCR2 = _tim16_cc2;

	//clear the flag
	//TIM3->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM3->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//activate the isr handler
void tmr16OC2AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM16_IRQn);			//disable irq

	_tim16_cc2isrptr = isrptr;			//install user handler

	//clear the flag
	TIM16->SR &=~TIM_SR_CC2IF;			//clear the interrupt flag
	TIM16->DIER |= TIM_DIER_CC2IE;		//enable the isr

	NVIC_EnableIRQ(TIM16_IRQn);			//enable irq
	//priorities not set -> default values used.
}

//ic1
void tmr16IC1Init(uint8_t ps) {
	//set up the capture channel 1
	TIM16->CCMR1 = (TIM16->CCMR1 &~TIM_CCMR1_CC1S) | (TIM_CCMR1_CC1S_0);	//0b01->input capture
	TIM16->CCMR1 = (TIM16->CCMR1 &~TIM_CCMR1_IC1PSC) | ((ps<<TIM_CCMR1_IC1PSC_Pos) & TIM_CCMR1_IC1PSC);	//INPUT prescaler: 0->1:1
	//clear the flag and disable the interrupt
	TIM16->SR &=~TIM_SR_CC1IF; TIM16->DIER &=~TIM_DIER_CC1IE;	//CLEAR_BIT the interrupt flag and disable the interrupt
	TIM16->CCER |= TIM_CCER_CC1E;							//1->ENABLE input capture, 0->disable ic 
	//map TIM16 rmp to MCO (=3)
	//TIM16->OR = (TIM16->OR &~TIM16_OR_TI1_RMP) | (((3) << 0) & TIM16_OR_TI1_RMP);	//0->gpio, 1->rtcclk, 2->hse/32, 3->mco
	//TIM16->EGR |=TIM_EGR_UG;								//force an update

#if defined(TIM16CH1toPIN)
	TIM16CH1toPIN();											//configure the input capture pin
#endif	//ch1
}

//activate the isr handler
void tmr16IC1AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM16_IRQn);		//disable irq

	_tim16_cc1isrptr = isrptr;			//install user handler

	//clear the flag
	TIM16->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	TIM16->DIER |= TIM_DIER_CC1IE;		//enable the isr

	NVIC_EnableIRQ(TIM16_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//ic2
void tmr16IC2Init(uint8_t ps) {
	//set up the capture channel 1
	TIM16->CCMR1 = (TIM16->CCMR1 &~TIM_CCMR1_CC2S) | (TIM_CCMR1_CC2S_0);	//0b01->input capture
	TIM16->CCMR1 = (TIM16->CCMR1 &~TIM_CCMR1_IC2PSC) | ((ps<<TIM_CCMR1_IC2PSC_Pos) & TIM_CCMR1_IC2PSC);	//INPUT prescaler: 0->1:1
	//clear the flag and disable the interrupt
	TIM16->SR &=~TIM_SR_CC2IF; TIM16->DIER &=~TIM_DIER_CC2IE;	//CLEAR_BIT the interrupt flag and disable the interrupt
	TIM16->CCER |= TIM_CCER_CC2E;							//1->ENABLE input capture, 0->disable ic 
	//map TIM16 rmp to MCO (=3)
	//TIM16->OR = (TIM16->OR &~TIM16_OR_TI1_RMP) | (((3) << 0) & TIM16_OR_TI1_RMP);	//0->gpio, 1->rtcclk, 2->hse/32, 3->mco
	//TIM16->EGR |=TIM_EGR_UG;								//force an update

#if defined(TIM16CH2toPIN)
	TIM16CH2toPIN();											//configure the input capture pin
#endif	//ch2
}

//activate the isr handler
void tmr16IC2AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM16_IRQn);		//disable irq

	_tim16_cc2isrptr = isrptr;			//install user handler

	//clear the flag
	TIM16->SR &=~TIM_SR_CC2IF;			//clear the interrupt flag
	TIM16->DIER |= TIM_DIER_CC2IE;		//enable the isr

	NVIC_EnableIRQ(TIM16_IRQn);		//enable irq
	//priorities not set -> default values used.
}

#endif	//tim16

#if defined(TIM17)
//tim17
//global variables
static void (* _tim17_ovfisrptr)(void)=empty_handler;				//tim4_ptr pointing to empty_handler by default
static void (* _tim17_cc1isrptr)(void)=empty_handler;				//tim4_ptr pointing to empty_handler by default
static void (* _tim17_cc2isrptr)(void)=empty_handler;				//tim4_ptr pointing to empty_handler by default
static uint16_t _tim17_cc1=0;
static uint16_t _tim17_cc2=0;

