dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.c
//isr for timer1 capture / compare
void TIM17_IRQHandler(void) {
	//cc1 isr
	if ((TIM17->SR & TIM_SR_CC1IF) && (TIM17->DIER & TIM_DIER_CC1IE)) {TIM17->SR &=~TIM_SR_CC1IF; if (TIM17->CCER & TIM_CCER_CC1E) _tim17_cc1 = TIM17->CCR1; else TIM17->CCR1 += _tim17_cc1; _tim17_cc1isrptr();}
	if ((TIM17->SR & TIM_SR_CC2IF) && (TIM17->DIER & TIM_DIER_CC2IE)) {TIM17->SR &=~TIM_SR_CC2IF; if (TIM17->CCER & TIM_CCER_CC2E) _tim17_cc1 = TIM17->CCR2; else TIM17->CCR2 += _tim17_cc2; _tim17_cc2isrptr();}
	
	//ovf isr
	if ((TIM17->SR & TIM_SR_UIF) && (TIM17->DIER & TIM_DIER_UIE)) {TIM17->SR &=~TIM_SR_UIF; _tim17_ovfisrptr();}
}

//initialize tim4 to use compare channels as timers
//17-bit prescaler. 32-bit used for compatability
void tmr17Init(uint16_t ps) {
	//route the clock to timer
	RCC->APBENR2 |= RCC_APBENR2_TIM17EN;

	//reset timer
	tmrInit(TIM17, ps);
}

//install user handler
void tmr17OVFAttachISR(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(TIM17_IRQn);		//disable irq

	_tim17_ovfisrptr = isr_ptr;			//install user handler

	//clear the flag
	TIM17->SR &=~TIM_SR_UIF;			//clear the interrupt flag
	TIM17->DIER |= TIM_DIER_UIE;		//enable the isr

	NVIC_EnableIRQ(TIM17_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//set TIM17_cc1 period
//pr is 16-bit. 32-bit used for compatability;
void tmr17OC1SetPR(uint16_t pr) {
	//save the period value
	_tim17_cc1 = pr - 0;
	TIM17->CCR1 = _tim17_cc1;

	//clear the flag
	//TIM3->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM3->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//activate the isr handler
void tmr17OC1AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM17_IRQn);			//disable irq

	_tim17_cc1isrptr = isrptr;			//install user handler

	//clear the flag
	TIM17->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	TIM17->DIER |= TIM_DIER_CC1IE;		//enable the isr

	NVIC_EnableIRQ(TIM17_IRQn);			//enable irq
	//priorities not set -> default values used.
}

//set TIM17_cc2 period
//pr is 16-bit. 32-bit used for compatability;
void tmr17OC2SetPR(uint16_t pr) {
	//save the period value
	_tim17_cc2 = pr - 0;
	TIM17->CCR2 = _tim17_cc2;

	//clear the flag
	//TIM3->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	//TIM3->DIER &=~TIM_DIER_CC1IE;		//disable the isr
}

//activate the isr handler
void tmr17OC2AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM17_IRQn);			//disable irq

	_tim17_cc2isrptr = isrptr;			//install user handler

	//clear the flag
	TIM17->SR &=~TIM_SR_CC2IF;			//clear the interrupt flag
	TIM17->DIER |= TIM_DIER_CC2IE;		//enable the isr

	NVIC_EnableIRQ(TIM17_IRQn);			//enable irq
	//priorities not set -> default values used.
}

//ic1
void tmr17IC1Init(uint8_t ps) {
	//set up the capture channel 1
	TIM17->CCMR1 = (TIM17->CCMR1 &~TIM_CCMR1_CC1S) | (TIM_CCMR1_CC1S_0);	//0b01->input capture
	TIM17->CCMR1 = (TIM17->CCMR1 &~TIM_CCMR1_IC1PSC) | ((ps<<TIM_CCMR1_IC1PSC_Pos) & TIM_CCMR1_IC1PSC);	//INPUT prescaler: 0->1:1
	//clear the flag and disable the interrupt
	TIM17->SR &=~TIM_SR_CC1IF; TIM17->DIER &=~TIM_DIER_CC1IE;	//CLEAR_BIT the interrupt flag and disable the interrupt
	TIM17->CCER |= TIM_CCER_CC1E;							//1->ENABLE input capture, 0->disable ic 
	//map TIM17 rmp to MCO (=3)
	//TIM17->OR = (TIM17->OR &~TIM17_OR_TI1_RMP) | (((3) << 0) & TIM17_OR_TI1_RMP);	//0->gpio, 1->rtcclk, 2->hse/32, 3->mco
	//TIM17->EGR |=TIM_EGR_UG;								//force an update


#if defined(TIM17CH1toPIN)
	TIM17CH1toPIN();											//configure the input capture pin
#endif	//ch1
}

//activate the isr handler
void tmr17IC1AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM17_IRQn);		//disable irq

	_tim17_cc1isrptr = isrptr;			//install user handler

	//clear the flag
	TIM17->SR &=~TIM_SR_CC1IF;			//clear the interrupt flag
	TIM17->DIER |= TIM_DIER_CC1IE;		//enable the isr

	NVIC_EnableIRQ(TIM17_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//ic2
void tmr17IC2Init(uint8_t ps) {
	//set up the capture channel 1
	TIM17->CCMR1 = (TIM17->CCMR1 &~TIM_CCMR1_CC2S) | (TIM_CCMR1_CC2S_0);	//0b01->input capture
	TIM17->CCMR1 = (TIM17->CCMR1 &~TIM_CCMR1_IC2PSC) | ((ps<<TIM_CCMR1_IC2PSC_Pos) & TIM_CCMR1_IC2PSC);	//INPUT prescaler: 0->1:1
	//clear the flag and disable the interrupt
	TIM17->SR &=~TIM_SR_CC2IF; TIM17->DIER &=~TIM_DIER_CC2IE;	//CLEAR_BIT the interrupt flag and disable the interrupt
	TIM17->CCER |= TIM_CCER_CC2E;							//1->ENABLE input capture, 0->disable ic 
	//map TIM17 rmp to MCO (=3)
	//TIM17->OR = (TIM17->OR &~TIM17_OR_TI1_RMP) | (((3) << 0) & TIM17_OR_TI1_RMP);	//0->gpio, 1->rtcclk, 2->hse/32, 3->mco
	//TIM17->EGR |=TIM_EGR_UG;								//force an update

#if defined(TIM17CH2toPIN)
	TIM17CH2toPIN();											//configure the input capture pin
#endif	//ch2
}

//activate the isr handler
void tmr17IC2AttachISR(void (*isrptr)(void)) {
	NVIC_DisableIRQ(TIM17_IRQn);		//disable irq

	_tim17_cc2isrptr = isrptr;			//install user handler

	//clear the flag
	TIM17->SR &=~TIM_SR_CC2IF;			//clear the interrupt flag
	TIM17->DIER |= TIM_DIER_CC2IE;		//enable the isr

	NVIC_EnableIRQ(TIM17_IRQn);		//enable irq
	//priorities not set -> default values used.
}

#endif		//tim17

//chained timers

#if defined(TIM3) && defined(TIM1)
//initialize tim31 as a synchronized 32-bit timer
//tim3 as master / lsw (including prescaler) to tim1 / msw of the 32-bit timer
//tim1 as slave / msw of the 32-bit timer
void tmr31Init(uint16_t ps) {
	//initialize tim3 as master
	//enable clock to tim3
	tmr3Init(ps); TIM3->CR1 &=~TIM_CR1_CEN;	//configure tim3 but stop it
	TIM3->CR2 = 0x20;					//MMS = 0b010->tim3 as prescaler
	//initialize tim1 as slave
	tmr1Init(1); TIM1->CR1 &=~TIM_CR1_CEN;	//configure tim2 but stop it
	//source from trgo -> enable slave mode and trigger on trgo
	TIM1->SMCR = (TIM1->SMCR &~(TIM_SMCR_TS | TIM_SMCR_SMS | TIM_SMCR_MSM)) |
			(0x02 << 4) | 				//tab 82: 0b010->//slave tim1 driven by tim3
			(0x07 << 0) |				//0b111->external trigger on trgo
			TIM_SMCR_MSM |					//1->enable slave mode
			0x00;

	TIM1->CNT = TIM3->CNT = 0;			//reset the conters
	
	//enable the timer, msw first
	TIM1->CR1 |= TIM_CR1_CEN;			//enable the timer
	TIM3->CR1 |= TIM_CR1_CEN;			//enable the timer
}

