dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.c
//read 32-bit timer value
uint32_t tmr31Get(void) {
	uint16_t msw, lsw;					//timer's high/low words

	//double read to maintain atomicity
	do {
		msw = TIM1->CNT;				//read the msw
		lsw = TIM3->CNT;				//read the lsw
	} while (msw != TIM1->CNT);			//see if overflow has taken place
	return ((uint32_t) msw << 16) | lsw;			//return 32-bit time
}

//set 32-bit timer period
uint32_t tmr31SetPR(uint32_t pr) {
	TIM3->ARR = (pr - 1);
	TIM1->ARR = (pr - 1)>> 16;
	return pr;
}

//read 32-bit timer period
uint32_t tmr31GetPR(void) {
	uint32_t tmp;
	
	tmp = TIM1->ARR;
	tmp = ((tmp << 16) | TIM3->ARR) + 1;
	return tmp;
}
#endif	//tim31


#if defined(TIM17) && defined(TIM1)
//initialize tim171 as a synchronized 32-bit timer
//tim17 as master / lsw (including prescaler) to tim1 / msw of the 32-bit timer
//tim1 as slave / msw of the 32-bit timer
void tmr171Init(uint16_t ps) {
	//initialize tim17 as master
	//enable clock to tim17
	tmr17Init(ps); TIM17->CR1 &=~TIM_CR1_CEN;	//configure tim2 but stop it
	TIM17->CR2 = 0x40;					//MMS = 0b100->tim16 oc1ref as prescaler 
	TIM17->CCER&=~TIM_CCER_CC1E;		//disable cc1
	TIM17->CCMR1 = (TIM17->CCMR1 &~(TIM_CCMR1_OC1M | TIM_CCMR1_CC1S)) | (6<<4) | (0<<0);	//6 or 7works, 0->as output
	//TIM17->ARR =-1;
	TIM17->CCR1=TIM17->ARR;
	TIM17->BDTR|= TIM_BDTR_MOE;			//1->set MOE - must have. I think this is a bug
	//TIM16->EGR|= TIM_EGR_CC1G;			//enable cc1g event generation
	//TIM16->SMCR=(TIM16->SMCR &~(TIM_SMCR_TS | TIM_SMCR_SMS | TIM_SMCR_MSM)) | 
	//			(0x02 << 4) |			//2->table 74: tim16 drives tim15
	//			(0x07<<0);				//0->channel as output
	TIM17->CCER|=TIM_CCER_CC1E;			//enable cc1

	//initialize tim1 as slave
	tmr1Init(1); TIM1->CR1 &=~TIM_CR1_CEN;	//configure tim1 but stop it
	//source from trgo -> enable slave mode and trigger on trgo
	TIM1->SMCR = (TIM1->SMCR &~(TIM_SMCR_TS | TIM_SMCR_SMS | TIM_SMCR_MSM)) |
			(0x03 << 4) | 				//tab 39: 0b011->//slave TIM1 driven by TIM17 oc1ref
			(0x07 << 0) |				//0b110->trigger mode, 0b111->external trigger on trgo
			TIM_SMCR_MSM |				//1->slave mode
			0x00;

	TIM1->CNT = TIM17->CNT = 0;			//reset the conters
	
	//enable the timer, msw first
	TIM1->CR1 |= TIM_CR1_CEN;			//enable the timer
	TIM17->CR1 |= TIM_CR1_CEN;			//enable the timer
}

//read 32-bit timer value
uint32_t tmr171Get(void) {
	uint16_t msw, lsw;					//timer's high/low words

	//double read to maintain atomicity
	do {
		msw = TIM1->CNT;				//read the msw
		lsw = TIM17->CNT;				//read the lsw
	} while (msw != TIM1->CNT);			//see if overflow has taken place
	return ((uint32_t) msw << 16) | lsw;			//return 32-bit time
}

//set 32-bit timer period
uint32_t tmr171SetPR(uint32_t pr) {
	TIM17->ARR = TIM17->CCR1 = (pr - 1);
	TIM1->ARR = (pr - 1)>> 16;
	return pr;
}

//read 32-bit timer period
uint32_t tmr171GetPR(void) {
	uint32_t tmp;
	
	tmp = TIM1->ARR;
	tmp = ((tmp << 16) | TIM17->ARR) + 1;
	return tmp;
}
#endif	//tim31

#if defined(TIM1) && defined(TIM3)
//initialize tim13 as a synchronized 32-bit timer
//tim1 as master / lsw (including prescaler) to tim3 / msw of the 32-bit timer
//tim3 as slave / msw of the 32-bit timer
void tmr13Init(uint16_t ps) {
	//initialize tim1 as master
	//enable clock to tim1
	tmr1Init(ps); TIM1->CR1 &=~TIM_CR1_CEN;	//configure tim3 but stop it
	TIM1->CR2 = 0x20;					//MMS = 0b010->tim3 as prescaler
	//initialize tim3 as slave
	tmr3Init(1); TIM3->CR1 &=~TIM_CR1_CEN;	//configure tim2 but stop it
	//source from trgo -> enable slave mode and trigger on trgo
	TIM3->SMCR = (TIM3->SMCR &~(TIM_SMCR_TS | TIM_SMCR_SMS | TIM_SMCR_MSM)) |
			(0x00 << 4) | 				//tab 43: 0b000->//slave tim3 driven by tim1
			(0x07 << 0) |				//0b111->external trigger on trgo
			TIM_SMCR_MSM |					//1->enable slave mode
			0x00;
	
	TIM3->CNT = TIM1->CNT = 0;			//reset the conters
	
	//enable the timer, msw first
	TIM3->CR1 |= TIM_CR1_CEN;			//enable the timer
	TIM1->CR1 |= TIM_CR1_CEN;			//enable the timer
}

//read 32-bit timer value
uint32_t tmr13Get(void) {
	uint16_t msw, lsw;					//timer's high/low words

	//double read to maintain atomicity
	do {
		msw = TIM3->CNT;				//read the msw
		lsw = TIM1->CNT;				//read the lsw
	} while (msw != TIM3->CNT);			//see if overflow has taken place
	return ((uint32_t) msw << 16) | lsw;			//return 32-bit time
}

//set 32-bit timer period
uint32_t tmr13SetPR(uint32_t pr) {
	TIM1->ARR = (pr - 1);
	TIM3->ARR = (pr - 1)>> 16;
	return pr;
}

//read 32-bit timer period
uint32_t tmr13GetPR(void) {
	uint32_t tmp;
	
	tmp = TIM3->ARR;
	tmp = ((tmp << 16) | TIM1->ARR) + 1;
	return tmp;
}
#endif	//tim13

#if defined(TIM14) && defined(TIM3)
//initialize tim143 as a synchronized 32-bit timer
//tim14 as master / lsw (including prescaler) to tim3 / msw of the 32-bit timer
//tim3 as slave / msw of the 32-bit timer
void tmr143Init(uint16_t ps) {
	//initialize tim17 as master
	//enable clock to tim17
	tmr14Init(ps); TIM14->CR1 &=~TIM_CR1_CEN;	//configure tim2 but stop it
	TIM14->CR2 = 0x40;					//MMS = 0b100->tim16 oc1ref as prescaler 
	TIM14->CCER&=~TIM_CCER_CC1E;		//disable cc1
	TIM14->CCMR1 = (TIM14->CCMR1 &~(TIM_CCMR1_OC1M | TIM_CCMR1_CC1S)) | (6<<4) | (0<<0);	//6 or 7works, 0->as output
	//TIM14->ARR =-1;
	TIM14->CCR1=TIM14->ARR;
	TIM14->BDTR|= TIM_BDTR_MOE;			//1->set MOE - must have. I think this is a bug
	//TIM16->EGR|= TIM_EGR_CC1G;			//enable cc1g event generation
	//TIM16->SMCR=(TIM16->SMCR &~(TIM_SMCR_TS | TIM_SMCR_SMS | TIM_SMCR_MSM)) | 
	//			(0x02 << 4) |			//2->table 74: tim16 drives tim15
	//			(0x07<<0);				//0->channel as output
	TIM14->CCER|=TIM_CCER_CC1E;			//enable cc1

	//initialize tim1 as slave
	tmr3Init(1); TIM3->CR1 &=~TIM_CR1_CEN;	//configure tim1 but stop it
	//source from trgo -> enable slave mode and trigger on trgo
	TIM3->SMCR = (TIM3->SMCR &~(TIM_SMCR_TS | TIM_SMCR_SMS | TIM_SMCR_MSM)) |
			(0x03 << 4) | 				//tab 43: 0b011->//slave TIM1 driven by TIM14 oc1ref
			(0x07 << 0) |				//0b110->trigger mode, 0b111->external trigger on trgo
			TIM_SMCR_MSM |				//1->slave mode
			0x00;

	TIM3->CNT = TIM14->CNT = 0;			//reset the conters
	
	//enable the timer, msw first
	TIM3->CR1 |= TIM_CR1_CEN;			//enable the timer
	TIM14->CR1|= TIM_CR1_CEN;			//enable the timer
}

