dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.c
	//configure gpio
#if defined(TIM1CH3toPIN)
	TIM1CH3toPIN();					//route TIM1CH1 to GPIO
#endif	//ch3
#if defined(TIM1CH3NtoPIN)
	TIM1CH3NtoPIN();
#endif	//ch3n
#endif	//ch3 || ch3n

#if defined(TIM1CH4toPIN) || defined(TIM1CH4NtoPIN)
	//configure CCP4
	TIM1->CCMR2 = 	(TIM1->CCMR1 &~0xff00) |
					(0<<15) |			//0->OC1REF not affedted by ETRF, 1->OC1REF cleared by ETRF high
					(6<<12) |			//0->frozen (for time base), 1->active on match, 2->inactive on match, 3->toggle, 4->inactive, 5->active, 6->pwm mode 1, 7->pwm mode 2
					(0<<11) |			//0->preload disabled, 1->preload enabled
					(0<<10) |			//0->fast disabled, 1->fast enabled
					(0<<8) |			//0->ch1 as output, 1->ch1 as input, 2->ch1 as input, 3->ch1 as input
					0x00;
	TIM1->CCER = 	(TIM1->CCER &~(0x0f << 12)) |
					(0<<15) |			//0->normal polarity for CC4N, 1->inverse polarity
#if defined(TIM1CH4NtoPIN)
					(1<<14) |			//0->disable CC4N, 1->enable CC4N
#else
					(0<<14) |			//0->disable CC4N, 1->enable CC4N
#endif	//ch4n
					(0<<13) |			//0->normal polarity for CC4, 1->inverse polarity
					(1<<12) |			//1->enable CC4, 0->disable CC4
					0x00;
	TIM1->CCR4 = 0;						//0% duty cycle

	//configure gpio
#if defined(TIM1CH4toPIN)
	TIM1CH4toPIN();						//route TIM1CH1 to GPIO
#endif	//ch4
#if defined(TIM1CH4NtoPIN)
	TIM1CH4NtoPIN();
#endif	//ch4n
#endif	//ch4 || ch4n

	//enable the timer.
	TIM1->CR1 |= TIM_CR1_CEN;			//enable the timer

}

#if defined(TIM3)
//initialize pwm to TxCCP_PS (prescaler) and TxCCP_PR (period)
void pwm3Init(uint16_t TxCCP_PS) {
	//route the clock to timer
	RCC->APBENR1 |= RCC_APBENR1_TIM3EN;

	pwmInit(TIM3, TxCCP_PS);			//initialize the pwm
	
	//configure CCP1..4
#if defined(TIM3CH1toPIN) || defined(TIM3CH1NtoPIN)
	//configure CCP1
	TIM3->CCMR1 = 	(TIM3->CCMR1 &~0x00ff) |
					(0<<7) |			//0->OC1REF not affedted by ETRF, 1->OC1REF cleared by ETRF high
					(6<<4) |			//0->frozen (for time base), 1->active on match, 2->inactive on match, 3->toggle, 4->inactive, 5->active, 6->pwm mode 1, 7->pwm mode 2
					(0<<3) |			//0->preload disabled, 1->preload enabled
					(0<<2) |			//0->fast disabled, 1->fast enabled
					(0<<0) |			//0->ch1 as output, 1->ch1 as input, 2->ch1 as input, 3->ch1 as input
					0x00;
	TIM3->CCER = 	(TIM3->CCER &~(0x0f << 0)) |
					(0<< 3) |			//0->normal polarity for CC1N, 1->inverse polarity
#if defined(TIM3CH1NtoPIN)
					(1<< 2) |			//0->disable CC1N, 1->enable CC1N
#else
					(0<< 2) |			//0->disable CC1N, 1->enable CC1N
#endif	//ch1n
					(0<< 1) |			//0->normal polarity for CC1, 1->inverse polarity
					(1<< 0) |			//1->enable CC1, 0->disable CC1
					0x00;
	TIM3->CCR1 = 0;						//0% duty cycle

	//configure the gpio for PWM output
#if defined(TIM3CH1toPIN)
	TIM3CH1toPIN();					//route TIM1CH1 to GPIO
#endif	//ch1
#if defined(TIM3CH1NtoPIN)
	TIM3CH1NtoPIN();
#endif	//ch1n
#endif	//ch1 || ch1n

#if defined(TIM3CH2toPIN) || defined(TIM3CH2NtoPIN)
	//configure CCP2
	TIM3->CCMR1 = 	(TIM3->CCMR1 &~0xff00) |
					(0<<15) |			//0->OC1REF not affedted by ETRF, 1->OC1REF cleared by ETRF high
					(6<<12) |			//0->frozen (for time base), 1->active on match, 2->inactive on match, 3->toggle, 4->inactive, 5->active, 6->pwm mode 1, 7->pwm mode 2
					(0<<11) |			//0->preload disabled, 1->preload enabled
					(0<<10) |			//0->fast disabled, 1->fast enabled
					(0<<8) |			//0->ch1 as output, 1->ch1 as input, 2->ch1 as input, 3->ch1 as input
					0x00;
	TIM3->CCER = 	(TIM3->CCER &~(0x0f << 4)) |
					(0<< 7) |			//0->normal polarity for CC2N, 1->inverse polarity
#if defined(TIM3CH2NtoPIN)
					(1<< 6) |			//0->disable CC2N, 1->enable CC2N
#else
					(0<< 6) |			//0->disable CC2N, 1->enable CC2N
#endif	//ch2n
					(0<< 5) |			//0->normal polarity for CC2, 1->inverse polarity
					(1<< 4) |			//1->enable CC2, 0->disable CC2
					0x00;
	TIM3->CCR2 = 0;						//0% duty cycle

	//configure the gpio for PWM output
#if defined(TIM3CH2toPIN)
	TIM3CH2toPIN();					//route TIM1CH1 to GPIO
#endif	//ch2
#if defined(TIM3CH2NtoPIN)
	TIM3CH2NtoPIN();
#endif	//ch2n
#endif	//ch2 || ch2n

#if defined(TIM3CH3toPIN) || defined(TIM3CH3NtoPIN)
	//configure CCP3
	TIM3->CCMR2 = 	(TIM3->CCMR2 &~0x00ff) |
					(0<<7) |			//0->OC1REF not affedted by ETRF, 1->OC1REF cleared by ETRF high
					(6<<4) |			//0->frozen (for time base), 1->active on match, 2->inactive on match, 3->toggle, 4->inactive, 5->active, 6->pwm mode 1, 7->pwm mode 2
					(0<<3) |			//0->preload disabled, 1->preload enabled
					(0<<2) |			//0->fast disabled, 1->fast enabled
					(0<<0) |			//0->ch1 as output, 1->ch1 as input, 2->ch1 as input, 3->ch1 as input
					0x00;
	TIM3->CCER = 	(TIM3->CCER &~(0x0f << 8)) |
					(0<<11) |			//0->normal polarity for CC3N, 1->inverse polarity
#if defined(TIM3CH3NtoPIN)
					(1<<10) |			//0->disable CC3N, 1->enable CC3N
#else
					(0<<10) |			//0->disable CC3N, 1->enable CC3N
#endif	//ch3n
					(0<< 9) |			//0->normal polarity for CC3, 1->inverse polarity
					(1<< 8) |			//1->enable CC3, 0->disable CC3
					0x00;
	TIM3->CCR3 = 0;						//0% duty cycle

	//configure the gpio for PWM output
#if defined(TIM3CH3toPIN)
	TIM3CH3toPIN();					//route TIM1CH1 to GPIO
#endif	//ch3
#if defined(TIM3CH3NtoPIN)
	TIM3CH3NtoPIN();
#endif	//ch3n
#endif	//ch3 || ch3n

#if defined(TIM3CH4toPIN) || defined(TIM3CH4NtoPIN)
	//configure CCP4
	TIM3->CCMR2 = 	(TIM3->CCMR2 &~0xff00) |
					(0<<15) |			//0->OC1REF not affedted by ETRF, 1->OC1REF cleared by ETRF high
					(6<<12) |			//0->frozen (for time base), 1->active on match, 2->inactive on match, 3->toggle, 4->inactive, 5->active, 6->pwm mode 1, 7->pwm mode 2
					(0<<11) |			//0->preload disabled, 1->preload enabled
					(0<<10) |			//0->fast disabled, 1->fast enabled
					(0<<8) |			//0->ch1 as output, 1->ch1 as input, 2->ch1 as input, 3->ch1 as input
					0x00;
	TIM3->CCER = 	(TIM3->CCER &~(0x0f << 12)) |
					(0<<15) |			//0->normal polarity for CC4N, 1->inverse polarity
#if defined(TIM3CH4NtoPIN)
					(1<<14) |			//0->disable CC4N, 1->enable CC4N
#else
					(0<<14) |			//0->disable CC4N, 1->enable CC4N
#endif	//ch4n
					(0<<13) |			//0->normal polarity for CC4, 1->inverse polarity
					(1<<12) |			//1->enable CC4, 0->disable CC4
					0x00;
	TIM3->CCR4 = 0;						//0% duty cycle

	//configure the gpio for PWM output
#if defined(TIM3CH4toPIN)
	TIM3CH4toPIN();					//route TIM1CH1 to GPIO
#endif	//ch4
#if defined(TIM3CH4NtoPIN)
	TIM3CH4NtoPIN();
#endif	//ch4n
#endif	//ch4 || ch4n

	//TIM3->EGR = 0xff;					//force an update
	//TIM3->BDTR|= TIM_BDTR_MOE;				//enable the main output
	//enable the timer.
	TIM3->CR1 |= TIM_CR1_CEN;			//enable the timer

