dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.c
	//TIM16->EGR = 0xff;					//force an update
	//TIM16->BDTR|= TIM_BDTR_MOE;				//enable the main output
	//enable the timer.
	TIM16->CR1 |= TIM_CR1_CEN;			//enable the timer

}

#if defined(TIM17)
/*
MAPR2 Bit 2 TIM17_REMAP: TIM17 remapping
This bit is set and cleared by software. It controls the mapping of the alternate functions of TIM17 channel 1 onto the GPIO ports.
0: No remap (CH1/PB9)
1: Remap (CH1/PA7)
*/
//initialize pwm to TxCCP_PS (prescaler) and TxCCP_PR (period)
void pwm17Init(uint16_t TxCCP_PS) {
	//route the clock to timer
	RCC->APBENR2 |= RCC_APBENR2_TIM17EN;

	pwmInit(TIM17, TxCCP_PS);			//initialize the pwm
	
	//configure CCP1..4
#if defined(TIM17CH1toPIN) || defined(TIM17CH1NtoPIN)
	//configure CCP1
	TIM17->CCMR1 = 	(TIM17->CCMR1 &~0x00ff) |
					(0<<7) |			//0->OC1REF not affedted by ETRF, 1->OC1REF cleared by ETRF high
					(6<<4) |			//0->frozen (for time base), 1->active on match, 2->inactive on match, 3->toggle, 4->inactive, 5->active, 6->pwm mode 1, 7->pwm mode 2
					(0<<3) |			//0->preload disabled, 1->preload enabled
					(0<<2) |			//0->fast disabled, 1->fast enabled
					(0<<0) |			//0->ch1 as output, 1->ch1 as input, 2->ch1 as input, 3->ch1 as input
					0x00;
	TIM17->CCER = 	(TIM17->CCER &~(0x0f << 0)) |
					(0<< 3) |			//0->normal polarity for CC1N, 1->inverse polarity
#if defined(TIM17CH1NtoPIN)
					(1<< 2) |			//0->disable CC1N, 1->enable CC1N
#else
					(0<< 2) |			//0->disable CC1N, 1->enable CC1N
#endif	//ch1n
					(0<< 1) |			//0->normal polarity for CC1, 1->inverse polarity
					(1<< 0) |			//1->enable CC1, 0->disable CC1
					0x00;
	TIM17->CCR1 = 0;						//0% duty cycle

	//configure the gpio for PWM output
#if defined(TIM17CH1toPIN)
	TIM17CH1toPIN();					//route TIM1CH1 to GPIO
#endif	//ch1n
#if defined(TIM17CH1NtoPIN)
	TIM17CH1NtoPIN();
#endif	//ch1n
#endif	//ch1 || ch1n

	//TIM17->EGR = 0xff;					//force an update
	//TIM17->BDTR|= TIM_BDTR_MOE;				//enable the main output
	//enable the timer.
	TIM17->CR1 |= TIM_CR1_CEN;			//enable the timer

}
#endif	//tim17

//lptimer
//genertic set up routine
void lptmrInit(LPTIM_TypeDef *LPTIMx, uint16_t ps) {
	//set up lptimer
	LPTIMx->CR &=~LPTIM_CR_ENABLE;				//1->enable the lptimer, 0->disable the lptimer
	LPTIMx->CFGR = 	((ps << LPTIM_CFGR_PRESC_Pos) & LPTIM_CFGR_PRESC) |	//set prescaler
					(0<<22) |					//0->no preload, 1->enable preload
					0x00;
	LPTIMx->CR = 	(0<<4) |					//0->reading lptim counter doesn't reset it, 1->reading lptim counter resets it
					(0<<1) |					//LPTIM_CR_SNGSTRT |				//ENABLE single shot mode -> the only mode available
					0x00;
	LPTIMx->ICR = LPTIM_ICR_ARRMCF;				//write 1 to clear the flag
	LPTIMx->IER&=~LPTIM_IER_ARRMIE;				//0->disable the interrupt
	LPTIMx->CR |= LPTIM_CR_ENABLE;				//1->enable the lptimer, 0->disable the lptimer
	LPTIMx->ARR = (uint32_t) -1;				//ARR at the top - can write to only after lptim has been enabled
}

//global variables
static void (* _lptim1_isrptr)(void)=empty_handler;				//tim4_ptr pointing to empty_handler by default
//static uint16_t _lptim1_pr=0;

void LPTIM1_IRQHandler(void) {
	LPTIM1->ICR = LPTIM_ICR_ARRMCF;				//write 1 to clear the flag
	//may want to process this in the user isr _lptim1_isrptr()
	LPTIM1->CR |= LPTIM_CR_SNGSTRT;				//1->start the timer, 0->stop the timer
	_lptim1_isrptr();							//execute user isr
}

//initialize lptimer
void lptmr1Init(uint8_t ps) {
	RCC->APBENR1 |= RCC_APBENR1_LPTIMEN;	//enable clock to lptimer
	
	lptmrInit(LPTIM1, ps);				//setup the lptimer
}

//install user handler
void lptmr1AttachISR(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(LPTIM1_IRQn);		//disable irq

	_lptim1_isrptr = isr_ptr;			//install user handler

	//clear the flag
	LPTIM1->ICR = LPTIM_ICR_ARRMCF;				//write 1 to clear the flag
	LPTIM1->IER|= LPTIM_IER_ARRMIE;				//0->disable the interrupt

	NVIC_EnableIRQ(LPTIM1_IRQn);		//enable irq
	//priorities not set -> default values used.
}

//end lptimer

//adc module
//global variables
//static uint32_t _adc_calfactor;				//adc calibration factor
//initialize adc: 12-bit, single conversion mode
void adc1Init(void) {
	uint32_t tmp;
	
	RCC->APBENR2 |= RCC_APBENR2_ADCEN;		//enable clock to ADC1

	//configure adc
	ADC1->CR&=~ADC_CR_ADEN;				//1->enable adc, 0->disable adc: can only configure if adc is enabled
	//ADC1->CR|= ADC_CR_ADSTP;				//1->stop the adc, 0->no effect
	//while (ADC1->CR & ADC_CR_ADSTP) continue;	//wait for the current adc conversion to stop
	ADC1->CR|= ADC_CR_ADEN;				//1->enable adc, 0->disable adc: can only configure if adc is enabled
	ADC1->CFGR1 = 	(0<<26) |				//0->awd on channel 0
					(0<<23) |				//0->AWD disabled
					(0<<22) |				//0->AWD on all channels (but disabled by bit 22
					(0<<16) |				//1->enable discontinuous conversion
					(1<<15) |				//0->auto off disabled
					(0<<14) |				//0->wait conversion disabled
					(0<<13) |				//0->single conversion mode, 1->continuous mode
					(0<<12) |				//0->adc data register preserved in overrun
					(0<<10) |				//00->hardware external trigger disabled
					(0<<6) |				//0000->external on TRG0 - but disabled
					(0<<5) |				//0->right aligned, 1->left aligned
					(0<<3) |				//00->data resolution = 12bit, 01->10bit, 10->8bit, 11->6bit
					(0<<2) |				//0->upward scan
					(0<<1) |				//0->DMA one shot mode selected
					(0<<0) |				//0->DMA disabled
					0x00;
	ADC1->CFGR2 = 	(4 << ADC_CFGR2_CKMODE_Pos);			//00->adc clock, 01->PCLK/2, 10->PCLK/4 -> no jitter
	//set adc sample time
	//0b111->239.5 cycles for all channels
	//set up smp time based on f_pclk
	if (F_PCLK > 4000000ul) tmp = 7; else tmp = 6;			//0->3.5 adc clock, 1->5.5, 2->7.5, 3->13.5, 4->28.5, 5->41.5, 6->71.5, 7->239.5
	ADC1->SMPR = 	((tmp << ADC_SMPR_SMP_Pos) & ADC_SMPR_SMP) |	
					0x00;
	//set adc channel sequence
	//ADC1->SQR3 = ADC1->SQR2 = ADC1->SQR1 = 0;							//0->1 conversion
	
	//start self-calibration - system calibrate the adc automatically on power-on
#if 0
	ADC1->CR|= ADC_CR_ADEN;					//1->enable adc, 0->disable adc
	ADC1->CCSR = (ADC1->CCSR &~ADC_CCSR_CALSMP) | (2 << ADC_CCSR_CALSMP_Pos);	//2->adc calibration smp: 0->2 adc clock, 1->4 adc clock, 2->8 adc clock, 3->1 adc clock
	ADC1->CCSR = (ADC1->CCSR &~ADC_CCSR_CALSEL) | (0 << ADC_CCSR_CALSEL_Pos);	//calibration context: 0->offset only, 1->offst and linearity
	ADC1->CR|= ADC_CR_ADCAL;				//1->start the calibration
	while (ADC1->CR & ADC_CR_ADCAL) continue;	//wait for ADC calibration to finish
	while (ADC1->CCSR & (ADC_CCSR_CALON | ADC_CCSR_CALFAIL)) continue;	//hang here if adc calibration error (calon and calfail <> 0)
	_adc_calfactor = ADC1->DR;				//save adc calibration factor - offset
#endif	//0

	//optional: enable temperature sensors
	ADC->CCR |= 	ADC_CCR_VREFEN |		//1->enable temperature sensor
					ADC_CCR_TSEN |			//1->enable Vrefint. 1.20v nominal
					0x00;

	//reset interrupt flags / interrupts
	ADC1->ISR = 0;							//CLEAR_BIT the flag
	ADC1->IER = 0;							//0->disable interrupt

