dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.c
	IC5BUF;								//read the buffer to clear the flag
	IFS2bits.IC5IF   = 0;				//0->clear the flag
	IEC2bits.IC5IE   = 0;				//1->enable the interrupt, 0->disable the interrupt
	//ICxIP   = 1;						//optional
	//enable the input capture
	//IC5CONbits.ON = 1;				//1->enable the module, 0->disable the module
#endif
}

//activate user ptr
void ic5AttachISR(void (*isrptr)(void)) {
	_ic5_isrptr = isrptr;				//install user ptr
	IC5BUF;								//read the buffer to clear the flag
	IFS2bits.IC5IF   = 0;				//0->clear the flag
	IEC2bits.IC5IE   = 1;				//1->enable the interrupt, 0->disable the interrupt
}

//read buffer value
uint16_t ic5Get(void) {
	return IC5DAT;
}
//end input capture
#endif

#if 0
//extint
//global variables
static void (* _exti0_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti1_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti2_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti3_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti4_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti5_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti6_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti7_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti8_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti9_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti10_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti11_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti12_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti13_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti14_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti15_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default

//EXTI0-1 ISR
void EXTI0_1_IRQHandler(void) {
	//clear the flag and execute user isr
	if (EXTI->PR & (1<< 0)) {EXTI->PR |= 1<< 0; _exti0_isrptr();}
	if (EXTI->PR & (1<< 1)) {EXTI->PR |= 1<< 1; _exti1_isrptr();}
}

//EXTI2-3 ISR
void EXTI2_3_IRQHandler(void) {
	//clear the flag and execute user isr
	if (EXTI->PR & (1<< 2)) {EXTI->PR |= 1<< 2; _exti2_isrptr();}
	if (EXTI->PR & (1<< 3)) {EXTI->PR |= 1<< 3; _exti3_isrptr();}
}

//EXTI15-10 ISR
void EXTI4_15_IRQHandler(void) {
	//clear the flag and execute user isr
	if (EXTI->PR & (1<< 4)) {EXTI->PR |= 1<< 4; _exti4_isrptr();}
	if (EXTI->PR & (1<< 5)) {EXTI->PR |= 1<< 5; _exti5_isrptr();}
	if (EXTI->PR & (1<< 6)) {EXTI->PR |= 1<< 6; _exti6_isrptr();}
	if (EXTI->PR & (1<< 7)) {EXTI->PR |= 1<< 7; _exti7_isrptr();}
	if (EXTI->PR & (1<< 8)) {EXTI->PR |= 1<< 8; _exti8_isrptr();}
	if (EXTI->PR & (1<< 9)) {EXTI->PR |= 1<< 9; _exti9_isrptr();}
	if (EXTI->PR & (1<<10)) {EXTI->PR |= 1<<10; _exti10_isrptr();}
	if (EXTI->PR & (1<<11)) {EXTI->PR |= 1<<11; _exti11_isrptr();}
	if (EXTI->PR & (1<<12)) {EXTI->PR |= 1<<12; _exti12_isrptr();}
	if (EXTI->PR & (1<<13)) {EXTI->PR |= 1<<13; _exti13_isrptr();}
	if (EXTI->PR & (1<<14)) {EXTI->PR |= 1<<14; _exti14_isrptr();}
	if (EXTI->PR & (1<<15)) {EXTI->PR |= 1<<15; _exti15_isrptr();}
}

//global defines
//global variables
//initialize the exti
//pin: one pin only
//gpio: GPIOA..GPIOG
void extiInit(PIN_TypeDef pinx, uint8_t edge) {
	uint16_t tmp=0;
	GPIO_TypeDef *gpio;
	uint16_t pin;
	
	gpio = GPIO_PinDef[pinx].gpio;
	pin  = GPIO_PinDef[pinx].mask;
	//enable afio
	//RCC->APBENR2 |= RCC_APBENR2_SYSCFGEN;
	//enable the clock
#if 0
	switch ((uint32_t) gpio) {						//switch can only be of integer type
#if defined(GPIOA)
		case (uint32_t) GPIOA: RCC->IOPENR |= RCC_IOPENR_GPIOAEN; tmp = 0x00; break;
#endif
#if defined(GPIOB)
		case (uint32_t) GPIOB: RCC->IOPENR |= RCC_IOPENR_GPIOBEN; tmp = 0x01; break;
#endif
#if defined(GPIOC)
		case (uint32_t) GPIOC: RCC->IOPENR |= RCC_IOPENR_GPIOCEN; tmp = 0x02; break;
#endif
#if defined(GPIOD)
		case (uint32_t) GPIOD: RCC->IOPENR |= RCC_IOPENR_GPIODEN; tmp = 0x03; break;
#endif
#if defined(GPIOE)
		case (uint32_t) GPIOE: RCC->IOPENR |= RCC_IOPENR_GPIOEEN; tmp = 0x04; break;
#endif
#if defined(GPIOF)
		case (uint32_t) GPIOF: RCC->IOPENR |= RCC_IOPENR_GPIOFEN; tmp = 0x05; break;
#endif
#if defined(GPIOG)
		case (uint32_t) GPIOG: RCC->IOPENR |= RCC_IOPENR_GPIOGEN; tmp = 0x06; break;
#endif
	}
#else

#if defined(GPIOA)
		if (gpio == GPIOA) {RCC->IOPENR |= RCC_IOPENR_GPIOAEN; tmp = 0x00; break;}
#endif
#if defined(GPIOB)
		if (gpio == GPIOB) {RCC->IOPENR |= RCC_IOPENR_GPIOBEN; tmp = 0x01; break;}
#endif
#if defined(GPIOC)
		if (gpio == GPIOC) {RCC->IOPENR |= RCC_IOPENR_GPIOCEN; tmp = 0x02; break;}
#endif
#if defined(GPIOD)
		if (gpio == GPIOD) {RCC->IOPENR |= RCC_IOPENR_GPIODEN; tmp = 0x03; break;}
#endif
#if defined(GPIOE)
		if (gpio == GPIOE) {RCC->IOPENR |= RCC_IOPENR_GPIOEEN; tmp = 0x04; break;}
#endif
#if defined(GPIOF)
		if (gpio == GPIOF) {RCC->IOPENR |= RCC_IOPENR_GPIOFEN; tmp = 0x05; break;}
#endif
#if defined(GPIOG)
		if (gpio == GPIOG) {RCC->IOPENR |= RCC_IOPENR_GPIOGEN; tmp = 0x06; break;}
#endif

#endif
	//configure exti edges
	//1->falling/rising edge enabled, 0->falling/rising edge disabled
	switch (edge) {
		case EXTI_FALLING: 	EXTI->FTSR |= pin; EXTI->RTSR &=~pin; break;
		case EXTI_RISING: 	EXTI->FTSR &=~pin; EXTI->RTSR |= pin; break;
		case EXTI_BOTH: 	EXTI->FTSR |= pin; EXTI->RTSR |= pin; break;
	}
	//disable the interrupts
	EXTI->EXTICR[0] = EXTI->EXTICR[1]=EXTI->EXTICR[2]=/*EXTI->EXTICR[3]=*/0x00;
	//configure the port
}

