dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.c
//install user handler
void extiAttachISR(PIN_TypeDef pinx, void (*isr_ptr)(void)) {
	GPIO_TypeDef *gpio;
	uint16_t pin=0;
	uint16_t gpiox=0;
	
	gpio = GPIO_PinDef[pinx].gpio;
	pin  = GPIO_PinDef[pinx].mask;

#if 0
	switch ((uint32_t) gpio) {
		case (uint32_t) GPIOA: gpiox=0; break;
#if defined(GPIOB)
		case (uint32_t) GPIOB: gpiox=1; break;
#endif
#if defined(GPIOC)
		case (uint32_t) GPIOC: gpiox=2; break;
#endif
#if defined(GPIOD)
		case (uint32_t) GPIOD: gpiox=3; break;
#endif
#if defined(GPIOE)
		case (uint32_t) GPIOE: gpiox=4; break;
#endif
#if defined(GPIOF)
		case (uint32_t) GPIOF: gpiox=5; break;
#endif
#if defined(GPIOG)
		case (uint32_t) GPIOG: gpiox=6; break;
#endif
	}
#else

#if defined(GPIOA)
		if (gpio == GPIOA) {gpiox=0; break;}
#endif
#if defined(GPIOB)
		if (gpio == GPIOB) {gpiox=1; break;}
#endif
#if defined(GPIOC)
		if (gpio == GPIOC) {gpiox=2; break;}
#endif
#if defined(GPIOD)
		if (gpio == GPIOD) {gpiox=3; break;}
#endif
#if defined(GPIOE)
		if (gpio == GPIOE) {gpiox=4; break;}
#endif
#if defined(GPIOF)
		if (gpio == GPIOF) {gpiox=5; break;}
#endif
#if defined(GPIOG)
		if (gpio == GPIOG) {gpiox=6; break;}
#endif

#endif
	
	pinMode(pinx, INPUT);						//default is floating input
	
	//clear the flag
	EXTI->PR |= pin;							//1->clear the flag
	//enable the interrupt
	EXTI->IMR |= pin;							//1->enable the interrupt, 0->disable the interrupt
	EXTI->EMR |= pin;							//1->enable the event trigger, 0->disable the event trigger

	//enable nvic
	switch (pin) {
		case (1<< 0): EXTI->EXTICR[0] |= gpiox << 0; NVIC_EnableIRQ(EXTI0_1_IRQn); _exti0_isrptr = isr_ptr; break;
		case (1<< 1): EXTI->EXTICR[0] |= gpiox << 8; NVIC_EnableIRQ(EXTI0_1_IRQn); _exti1_isrptr = isr_ptr; break;
		case (1<< 2): EXTI->EXTICR[0] |= gpiox <<16; NVIC_EnableIRQ(EXTI2_3_IRQn); _exti2_isrptr = isr_ptr; break;
		case (1<< 3): EXTI->EXTICR[0] |= gpiox <<24; NVIC_EnableIRQ(EXTI2_3_IRQn); _exti3_isrptr = isr_ptr; break;
		case (1<< 4): EXTI->EXTICR[1] |= gpiox << 0; NVIC_EnableIRQ(EXTI4_15_IRQn); _exti4_isrptr = isr_ptr; break;
		case (1<< 5): EXTI->EXTICR[1] |= gpiox << 8; NVIC_EnableIRQ(EXTI4_15_IRQn); _exti5_isrptr = isr_ptr; break;
		case (1<< 6): EXTI->EXTICR[1] |= gpiox <<16; NVIC_EnableIRQ(EXTI4_15_IRQn); _exti6_isrptr = isr_ptr; break;
		case (1<< 7): EXTI->EXTICR[1] |= gpiox <<24; NVIC_EnableIRQ(EXTI4_15_IRQn); _exti7_isrptr = isr_ptr; break;
		case (1<< 8): EXTI->EXTICR[2] |= gpiox << 0; NVIC_EnableIRQ(EXTI4_15_IRQn); _exti8_isrptr = isr_ptr; break;
		case (1<< 9): EXTI->EXTICR[2] |= gpiox << 8; NVIC_EnableIRQ(EXTI4_15_IRQn); _exti9_isrptr = isr_ptr; break;
		case (1<<10): EXTI->EXTICR[2] |= gpiox <<16; NVIC_EnableIRQ(EXTI4_15_IRQn); _exti10_isrptr = isr_ptr; break;
		case (1<<11): EXTI->EXTICR[2] |= gpiox <<24; NVIC_EnableIRQ(EXTI4_15_IRQn); _exti11_isrptr = isr_ptr; break;
		//case (1<<12): EXTI->EXTICR[3] |= gpiox << 0; NVIC_EnableIRQ(EXTI4_15_IRQn); _exti12_isrptr = isr_ptr; break;
		//case (1<<13): EXTI->EXTICR[3] |= gpiox << 8; NVIC_EnableIRQ(EXTI4_15_IRQn); _exti13_isrptr = isr_ptr; break;
		//case (1<<14): EXTI->EXTICR[3] |= gpiox <<16; NVIC_EnableIRQ(EXTI4_15_IRQn); _exti14_isrptr = isr_ptr; break;
		//case (1<<15): EXTI->EXTICR[3] |= gpiox <<24; NVIC_EnableIRQ(EXTI4_15_IRQn); _exti15_isrptr = isr_ptr; break;
	}
}

//extint0
#endif	//0

#if 0
void (* _int0_isrptr) (void)=empty_handler;

void _ISR_PSV _INT0Interrupt(void) {
	IFS0bits.INT0IF = 0;				//clera the flag
	_int0_isrptr();						//run the isr
}

void int0Init(void) {
	//INT02RP();						//map int0_pin - int0 cannot be remapped
	_int0_isrptr = empty_handler;		//initialize int isr ptr
	IFS0bits.INT0IF = 0;				//clear int0 flag
	IEC0bits.INT0IE = 0;				//1->enable int0 interrupt, 0->disable the interrupt
	//INTCONbits.INT0EP = 1;			//1=triggered on the falling edge. 0 = rising edge
}

void int0AttachISR(void (*isrptr) (void)) {
	_int0_isrptr = isrptr;
	IFS0bits.INT0IF = 0;				//clear int0 flag
	IEC0bits.INT0IE = 1;				//1->enable int0 interrupt, 0->disable the interrupt
}

//extint1
void (* _int1_isrptr) (void)=empty_handler;

void _ISR_PSV _INT1Interrupt(void) {
	IFS1bits.INT1IF = 0;				//clera the flag
	_int1_isrptr();						//run the isr
}

void int1Init(void) {
	INT12RP();							//map int1_pin
	_int1_isrptr = empty_handler;		//initialize int isr ptr
	IFS1bits.INT1IF = 0;				//clear int0 flag
	IEC1bits.INT1IE = 0;				//1->enable int0 interrupt, 0->disable the interrupt
	//INTCONbits.INT1EP = 1;			//1=triggered on the falling edge. 0 = rising edge
}

void int1AttachISR(void (*isrptr) (void)) {
	_int1_isrptr = isrptr;
	IFS1bits.INT1IF = 0;				//clear int0 flag
	IEC1bits.INT1IE = 1;				//1->enable int0 interrupt, 0->disable the interrupt
}

//extint2
void (* _int2_isrptr) (void)=empty_handler;

void _ISR_PSV _INT2Interrupt(void) {
	IFS1bits.INT2IF = 0;				//clera the flag
	_int2_isrptr();						//run the isr
}

void int2Init(void) {
	INT22RP();							//map int2_pin
	_int2_isrptr = empty_handler;		//initialize int isr ptr
	IFS1bits.INT2IF = 0;				//clear int0 flag
	IEC1bits.INT2IE = 0;				//1->enable int0 interrupt, 0->disable the interrupt
	//INTCONbits.INT2EP = 1;			//1=triggered on the falling edge. 0 = rising edge
}

void int2AttachISR(void (*isrptr) (void)) {
	_int2_isrptr = isrptr;
	IFS1bits.INT2IF = 0;				//clear int0 flag
	IEC1bits.INT2IE = 1;				//1->enable int0 interrupt, 0->disable the interrupt
}


//end extint
#endif	//0

//spi
//rest spi1
void spi1Init(uint32_t br) {
	uint32_t tmp;
	RCC->APBENR2 |= RCC_APBENR2_SPI1EN;	//1->enable the module
	
	//initialize the spi module
	//master mode, PBCLK as clock, 8-bit data, enhanced buffer mode
	//master only, clock polarity: 0 at idle, clock phase: capture on first edge
	SPI1->CR1 = SPI1->CR2 = SPI1->SR = 0;	//reset the spi module
	for (tmp = 0; tmp < 7; tmp++)
		if ((F_PCLK >> (tmp+1)) <= br) break;
	SPI1->CR1 = (SPI1->CR1 &~SPI_CR1_BR) | ((tmp << 3) & SPI_CR1_BR);
	SPI1->CR1 |= SPI_CR1_MSTR_Pos;		//1->master mode, 0->slave mode
	SPI1->CR2 = (SPI1->CR2 &~SPI_CR2_DS) | ((0x07<< 8) & SPI_CR2_DS);	//8bit data length: default
	SPI1->CR2 &=~SPI_CR2_TXEIE;			//0->disable tx empty interrupt
	SPI1->CR2 &=~SPI_CR2_RXNEIE;		//0->disable rx not empty  interrupt
	SPI1->CR2 &=~SPI_CR2_ERRIE;			//0->disable error interrupt
	//SPI1->CR2 &=~SPI_CR2_FRF;			//0->motorolla frame mode, 1->TI frame mode
	//SPI1->CR2 &=~SPI_CR2_NSSP;			//0->no nss pin mgmt
	SPI1->CR2 &=~SPI_CR2_SSOE;			//0->SS output disabled
	//IFS0bits.SPI1IF = 0;				//0->reset the flag
	//IEC0bits.SPI1IE = 0;				//0->disable the interrupt, 1->enable the interrupt
	SPI1->CR1 |= SPI_CR1_SPE;			//1->enable the module, 0->disable the module

	//map the pins
#if defined(NSS1toPIN)
	SPI1->CR2 |= SPI_CR2_NSSP;			//1->with nss pin mgmt
	NSS1toPIN();
#endif
#if defined(SCK1toPIN)
	SCK1toPIN();
#endif
#if defined(MOSI1toPIN)
	MOSI1toPIN();
#endif
#if defined(MISO1toPIN)
	MISO1toPIN();
#endif

