dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.c
}

#if defined(SPI2)
//rest spi2
void spi2Init(uint32_t br) {
	uint32_t tmp;
	RCC->APBENR1 |= RCC_APBENR1_SPI2EN;	//1->enable the module
	
	//initialize the spi module
	//master mode, PBCLK as clock, 8-bit data, enhanced buffer mode
	//master only, clock polarity: 0 at idle, clock phase: capture on first edge
	SPI2->CR1 = SPI2->CR2 = SPI2->SR = 0;	//reset the spi module
	for (tmp = 0; tmp < 7; tmp++)
		if ((F_PCLK >> (tmp+1)) <= br) break;
	SPI2->CR1 = (SPI2->CR1 &~SPI_CR1_BR) | ((tmp << 3) & SPI_CR1_BR);
	SPI2->CR1 |= SPI_CR1_SSM;			//1->master mode, 0->slave mode
	SPI2->CR2 = (SPI2->CR2 &~SPI_CR2_DS) | ((0x07<< 8) & SPI_CR2_DS);	//8bit data length: default
	SPI2->CR2 &=~SPI_CR2_TXEIE;			//0->disable tx empty interrupt
	SPI2->CR2 &=~SPI_CR2_RXNEIE;		//0->disable rx not empty  interrupt
	SPI2->CR2 &=~SPI_CR2_ERRIE;			//0->disable error interrupt
	//SPI2->CR2 &=~SPI_CR2_FRF;			//0->motorolla frame mode, 1->TI frame mode
	//SPI2->CR2 &=~SPI_CR2_NSSP;			//0->no nss pin mgmt
	SPI2->CR2 &=~SPI_CR2_SSOE;			//0->SS output disabled
	//IFS0bits.SPI2IF = 0;				//0->reset the flag
	//IEC0bits.SPI2IE = 0;				//0->disable the interrupt, 1->enable the interrupt
	SPI2->CR1 |= SPI_CR1_SPE;			//1->enable the module, 0->disable the module

	//map the pins
#if defined(NSS2toPIN)
	SPI2->CR2 |= SPI_CR2_NSSP;			//1->with nss pin mgmt
	NSS2toPIN();
#endif
#if defined(SCK2toPIN)
	SCK2toPIN();
#endif
#if defined(MOSI2toPIN)
	MOSI2toPIN();
#endif
#if defined(MISO2toPIN)
	MISO2toPIN();
#endif

}

#endif 	//spi2
//end spi

//i2c
//generic i2c initialization
void i2cInit(I2C_TypeDef *I2Cx, uint32_t br) {
	//configure i2c
	//I2Cx->CR1 = I2Cx->CR2 = I2Cx->SR = 0;		//initialize the registers
	I2Cx->CR1 = 0;								//reset state
	//need to figure out timing parameters
	I2Cx->CR2 = APBClock() / 1000000ul;			//4->4Mhz, 36->36Mhz, 48->48Mhz
	if (I2Cx->CR2 < 4) I2Cx->CR2 = 4;			//4 is minimum
	if (I2Cx->CR2 >48) I2Cx->CR2 =48;			//48 is max
	
	I2Cx->SR2|= I2C_SR2_MSL;					//1->master, 0->slave
	
	//enable the i2c
	//I2Cx->CR1 |= I2C_CR1_PE;					//1->enable the i2c module
}

#ifndef RCC_APBENR1_I2C1EN
#define RCC_APBENR1_I2C1EN		RCC_APBENR1_I2CEN	//for f030x6
#endif	//RCC_APBENR1_I2C1EN
//i2c1 initialization
void i2c1Init(uint32_t br) {
	RCC->APBENR1 |= RCC_APBENR1_I2C1EN;			//1->enable clock

	//configure i2c1
	i2cInit(I2C1, br);

	//enable the i2c
	I2C1->CR1 |= I2C_CR1_PE;					//1->enable the i2c module
	
	//scl/sda pins must exist!
#if defined(SCL1toPIN)
	SCL1toPIN();								//enable scl pin - you must have SCL pins
#endif

#if defined(SDA1toPIN)
	SDA1toPIN();								//enable sda pin - you must have SDA pins
#endif
}

//send multiple bytes
int16_t i2c1Writes(uint8_t DeviceAddr, uint8_t RegAddr, uint8_t* pBuffer, uint16_t NumByteToWrite) {  
	while (i2c1Busy()) continue;				//wait for the prior transmission to end
	
	i2c1Start();								//send a start condition
	i2c1WriteAddr(DeviceAddr | I2C_CMD_WRITE);	//write device address
	i2c1Write(RegAddr);							//WRITE_REG the register address
	//write multiple bytes
	while(NumByteToWrite--) 
		i2c1Write(*pBuffer++);					//send data
	i2c1Stop();  								//generate stop condition
	i2c1Ack();									//enable ack
	return 0;
}

//read multiple bytes
int16_t i2c1Reads(uint8_t DeviceAddr, uint8_t RegAddr, uint8_t* pBuffer, uint16_t NumByteToRead) {  
	while (i2c1Busy()) continue;				//wait for the prior transmission to end
	
	i2c1Start();								//send a start condition
	i2c1WriteAddr(DeviceAddr | I2C_CMD_WRITE);	//write device address
	i2c1Write(RegAddr);							//WRITE_REG the register address
	
	//send the start condition again
	i2c1Start();								//send a start condition
	i2c1WriteAddr(DeviceAddr | I2C_CMD_READ);	//write device address
	I2C1->SR1; I2C1->SR2;						//clear the status
	//read multiple bytes
	while(NumByteToRead) {
		if (NumByteToRead==1) {i2c1NoAck(); i2c1Stop();}
		if (i2c1Avail()) {*pBuffer++=I2C1->DR; NumByteToRead--;}
	}
	i2c1Ack();									//enable ack
	return 0;
}

//end i2c


#if defined(RTC)
//rtcc
//global variables
static void (* _isrptr_ovf)(void)=empty_handler;			//rtc overflow flag
static void (* _isrptr_alr)(void)=empty_handler;			//rtc alarm flag
static void (* _isrptr_sec)(void)=empty_handler;			//rtc second flag

//rtc alarm isr
void RTC_IRQHandler(void) {
	//overflow isr
	if ((RTC->CRL & RTC_CRL_OWF) && (RTC->CRH & RTC_CRH_OWIE)) {							//overflow flag is set
		_isrptr_ovf();										//execute user handler
		//enable write access to rtc registers
		PWR->CR1      |= PWR_CR1_DBP;						// enable write access to RTC, BDC registers
		RTC->CRL &=~RTC_CRL_OWF;							//clear the overflow flag
		//disable write access to rtc registers
		PWR->CR1      &=~PWR_CR1_DBP;						// disable write access to RTC, BDC registers
	}

	//alarm isr - can be configured through EXTI line 17 as well
	if ((RTC->CRL & RTC_CRL_ALRF) && (RTC->CRH & RTC_CRH_ALRIE)) {							//overflow flag is set
		_isrptr_alr();										//execute user handler
		//enable write access to rtc registers
		PWR->CR1      |= PWR_CR1_DBP;						// enable write access to RTC, BDC registers
		RTC->CRL &=~RTC_CRL_ALRF;							//clear the overflow flag
		//disable write access to rtc registers
		PWR->CR1      &=~PWR_CR1_DBP;						// disable write access to RTC, BDC registers
	}

	//second isr
	if ((RTC->CRL & RTC_CRL_SECF) && (RTC->CRH & RTC_CRH_SECIE)) {							//overflow flag is set
		_isrptr_sec();										//execute user handler
		//enable write access to rtc registers
		PWR->CR1      |= PWR_CR1_DBP;						// enable write access to RTC, BDC registers
		RTC->CRL &=~RTC_CRL_SECF;							//clear the overflow flag
		//disable write access to rtc registers
		PWR->CR1      &=~PWR_CR1_DBP;						// disable write access to RTC, BDC registers
	}
}

//reset the rtc
//ps = prescaler
//for 32768Khz, 0x7fff for 1-second
//pr = period for alarm
//alarm isr is disabled
//rtcc_clk is clock source:
//RCC_BDCR_RTCSEL_LSI, RCC_BDCR_RTCSEL_LSE and RCC_BDCR_RTCSEL_HSE (HSE/128)
void RTCInit(uint32_t rtcc_clk, uint32_t ps) {
	_isrptr_alr = _isrptr_ovf = _isrptr_sec = empty_handler;	//set default isr_ptr value

	RCC->APBENR1 |= RCC_APBENR1_RTCAPBEN |		//1->enable rtc, 0->disable rtc  clock
					RCC_APBENR1_PWREN |			//1->enable low power control block
					0x00;
	
