dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.c
	PWR->CR1     |= PWR_CR1_DBP;							// enable access to RTC, BDC registers
	//reset backup domain: BDRST bit goes through a 1->0 transition -> needed to change rtc clock selection
	RCC->BDCR    |= RCC_BDCR_BDRST; RCC->BDCR    &=~RCC_BDCR_BDRST;		  //1->0: reset the backup domain
	switch (rtcc_clk) {
	case RCC_BDCR_RTCSEL_LSI:		//lsi
		//enable LSI -> only if LSI is used as a clock source
		RCC->CSR |= RCC_CSR_LSION;							//1->turn on LSI, 0->turn off LSI
		while ((RCC->CSR & RCC_CSR_LSIRDY) == 0) continue;	//1->LSI ready, 0->LSI not ready
		RCC->BDCR = (RCC->BDCR &~RCC_BDCR_RTCSEL_HSE) | (RCC_BDCR_RTCSEL_LSI);          // set RTC clock source(LSI/LSE/HSE), enable RTC clock
		break;
	case RCC_BDCR_RTCSEL_LSE:		//lse
		//enable LSE and wait for it to be ready
		RCC->BDCR |= RCC_BDCR_LSEON;						//1->turn on LSE, 0->turn off LSE
		while ((RCC->BDCR & RCC_BDCR_LSERDY) == 0) continue;	//1->LSE ready, 0->LSE not ready
		RCC->BDCR = (RCC->BDCR &~RCC_BDCR_RTCSEL_HSE) | (RCC_BDCR_RTCSEL_LSE);          // set RTC clock source(LSI/LSE/HSE), enable RTC clock
		break;
	case RCC_BDCR_RTCSEL_HSE:		//hse/128
		//enable HSE ->
		RCC->CR |= RCC_CR_HSEON;							//1->turn on LSI, 0->turn off LSI
		while ((RCC->CR & RCC_CR_HSERDY) == 0) continue;	//1->HSE ready, 0->HSE not ready
		RCC->BDCR = (RCC->BDCR &~RCC_BDCR_RTCSEL_HSE) | (RCC_BDCR_RTCSEL_HSE);          // set RTC clock source(LSI/LSE/HSE), enable RTC clock
		break;
	}
	RCC->BDCR |= RCC_BDCR_RTCEN;							//1->enable rtc
	RTC->CRL &= ~RTC_CRL_RSF;                  			//Clear registers Synchronized Flag
	while((RTC->CRL & RTC_CRL_RSF) == 0) continue;      //Wait for the RSF bit in RTC_CRL to be set by hardware
	//configuration sequence
	//1. wait for rtoff goes high
	while (!RTC->CRL & RTC_CRL_RTOFF) continue;
	//2. set cnf to enter configuration mode
	RTC->CRL |= RTC_CRL_CNF;
	//3. write to 1 or more rtc registers
	PWR->CR1 |= PWR_CR1_DBP;					//1->set dbp bit, 0->clear dbp bit
	ps = ps - 1;								//update the prescaler
	RTC->PRLL = ps; RTC->PRLH = ps >> 16;		//setup hte prescaler. can only write to this if PWR_CR1.DBP is 1
	RCC->BDCR = (RCC->BDCR &~RCC_BDCR_RTCSEL) | (rtcc_clk & RCC_BDCR_RTCSEL);	//can only write to it if pwr_cr1.dbp is 1
	PWR->CR1 &=~PWR_CR1_DBP;					//1->set dbp bit, 0->clear dbp bit
	//4. clear cnf to exit configuration mode
	RTC->CRL &=~RTC_CRL_CNF;
	//5. poll rtoff until it changes to 1
	while (!RTC->CRL & RTC_CRL_RTOFF) continue;
	//enable rtc
	//RCC->BDCR |= RCC_BDCR_RTCEN;				//1->enable rtc, 0->disable rtc
}

//install rtc overflow isr
void RTCOVFAttachISRF(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(RTC_IRQn);					//disable rtc handler
	_isrptr_ovf = isr_ptr;						//install user handler
	//enable write access to rtc registers
	PWR->CR1      |= PWR_CR1_DBP;							// enable write access to RTC, BDC registers
	//unlocking sequence needed for CRL, CNT and ALR registers
	while ((RTC->CRL & RTC_CRL_RTOFF) == 0) continue;	//wait for RTOFF value to 1 -> prior operations have finished
	//clear the flags
	RTC->CRL &=~RTC_CRL_OWF;					//clear the overflow flags
	RTC->CRH |= RTC_CRH_OWIE;					//1->enable overflow interrupt
	//disable write access to rtc registers
	RTC->CRL &=~RTC_CRL_CNF;					//1->set CNF to enter configuration mode, 0->exit configuration mode
	while ((RTC->CRL & RTC_CRL_RTOFF) == 0) continue;	//wait for RTOFF value to 1 -> prior operations have finished
	PWR->CR1      &=~PWR_CR1_DBP;							// disable access to RTC, BDC registers
	NVIC_EnableIRQ(RTC_IRQn);					//enable rtc handler
}

//install rtc alarm isr
void RTCALRAttachISR(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(RTC_IRQn);					//disable rtc handler
	_isrptr_alr = isr_ptr;						//install user handler
	PWR->CR1      |= PWR_CR1_DBP;							// enable write access to RTC, BDC registers
	//unlocking sequence needed for CRL, CNT and ALR registers
	while ((RTC->CRL & RTC_CRL_RTOFF) == 0) continue;	//wait for RTOFF value to 1 -> prior operations have finished
	//clear the flags
	RTC->CRL &=~RTC_CRL_ALRF;					//clear the overflow flags
	RTC->CRH |= RTC_CRH_ALRIE;					//1->enable overflow interrupt
	//disable write access to rtc registers
	RTC->CRL &=~RTC_CRL_CNF;					//1->set CNF to enter configuration mode, 0->exit configuration mode
	while ((RTC->CRL & RTC_CRL_RTOFF) == 0) continue;	//wait for RTOFF value to 1 -> prior operations have finished
	PWR->CR1      &=~PWR_CR1_DBP;							// disable access to RTC, BDC registers
	NVIC_EnableIRQ(RTC_IRQn);					//enable rtc handler
}

//install rtc second isr
void RTCSECAttachISR(void (*isr_ptr)(void)) {
	NVIC_DisableIRQ(RTC_IRQn);								//disable rtc handler
	PWR->CR1      |= PWR_CR1_DBP;							// enable write access to RTC, BDC registers
	//unlocking sequence needed for CRL, CNT and ALR registers
	while ((RTC->CRL & RTC_CRL_RTOFF) == 0) continue;		//wait for RTOFF value to 1 -> prior operations have finished
	_isrptr_sec = isr_ptr;									//install user handler
	//clear the flags
	RTC->CRL &=~RTC_CRL_SECF;								//clear the overflow flags
	RTC->CRH |= RTC_CRH_SECIE;								//1->enable overflow interrupt
	//disable write access to rtc registers
	RTC->CRL &=~RTC_CRL_CNF;								//1->set CNF to enter configuration mode, 0->exit configuration mode
	while ((RTC->CRL & RTC_CRL_RTOFF) == 0) continue;		//wait for RTOFF value to 1 -> prior operations have finished
	PWR->CR1      &=~PWR_CR1_DBP;							// disable access to RTC, BDC registers
	NVIC_EnableIRQ(RTC_IRQn);								//enable rtc handler
}

//set rtc counter
uint32_t RTCSetCNT(uint32_t val) {
	PWR->CR1      |= PWR_CR1_DBP;							// enable write access to RTC, BDC registers
	//unlocking sequence needed for CRL, CNT and ALR registers
	while ((RTC->CRL & RTC_CRL_RTOFF) == 0) continue;		//wait for RTOFF value to 1 -> prior operations have finished
	RTC->CRL |= RTC_CRL_CNF;								//1->set CNF to enter configuration mode, 0->exit configuration mode
	//write to one or more RTC registers
	RTC->CNTH = val >> 16; RTC->CNTL = val;					//set up the counter
	//RTC->ALRH = alr >> 16; RTC->ALRL = alr;				//set up the alarm
	//locking sequency
	RTC->CRL &=~RTC_CRL_CNF;								//1->set CNF to enter configuration mode, 0->exit configuration mode
	while ((RTC->CRL & RTC_CRL_RTOFF) == 0) continue;		//wait for RTOFF value to 1 -> prior operations have finished
	PWR->CR1      &=~PWR_CR1_DBP;							// disable access to RTC, BDC registers
	return val;
}

//read rtc counter
uint32_t RTCGetCNT(void) {
	uint32_t tmp;
	uint16_t lsb;

	RTC->CRL &= ~RTC_CRL_RSF;                  				//Clear registers Synchronized Flag
	while((RTC->CRL & RTC_CRL_RSF) == 0) continue;     	 	//Wait for the RSF bit in RTC_CRL to be set by hardware
	do {
		tmp = RTC->CNTH;
		lsb = RTC->CNTL;
	} while (tmp != RTC->CNTH);

