dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.c
	return (tmp << 16) | lsb;
}

//set rtc alarm
uint32_t RTCSetALR(uint32_t val) {
	PWR->CR1      |= PWR_CR1_DBP;							// enable write access to RTC, BDC registers
	//unlocking sequence needed for CRL, CNT and ALR registers
	while ((RTC->CRL & RTC_CRL_RTOFF) == 0) continue;		//wait for RTOFF value to 1 -> prior operations have finished
	RTC->CRL |= RTC_CRL_CNF;								//1->set CNF to enter configuration mode, 0->exit configuration mode
	//write to one or more RTC registers
	//RTC->CNTH = val >> 16; RTC->CNTL = val;				//set up the counter
	RTC->ALRH = val >> 16; RTC->ALRL = val;					//set up the alarm
	//locking sequency
	RTC->CRL &=~RTC_CRL_CNF;								//1->set CNF to enter configuration mode, 0->exit configuration mode
	while ((RTC->CRL & RTC_CRL_RTOFF) == 0) continue;		//wait for RTOFF value to 1 -> prior operations have finished
	PWR->CR1      &=~PWR_CR1_DBP;							// disable access to RTC, BDC registers
	return val;
}

//read rtc alarm - not working correct: always return 0
uint32_t RTCGetALR(void) {
	uint32_t tmp;
	uint16_t lsb;

	RTC->CRL &= ~RTC_CRL_RSF;                  				//Clear registers Synchronized Flag
	while((RTC->CRL & RTC_CRL_RSF) == 0) continue;     	 	//Wait for the RSF bit in RTC_CRL to be set by hardware
	do {
		tmp = RTC->ALRH;
		lsb = RTC->ALRL;
	} while (tmp != RTC->ALRH);

	return (tmp << 16) | lsb;
}

//read rtc
time_t RTC2time(time_t *t) {
	uint32_t tmp=RTCGetCNT();


	if (t==NULL) return (tmp==0)?((uint32_t) -1):tmp; 			//just return seconds since epoch time if pointer is NULL
	return *t=(tmp==0)?((uint32_t) -1):tmp;						//change pointed value + return seconds since epoch time
}

//initialize rtc with time_t
time_t time2RTC(time_t t) {
	t=(t<946684800ul)?946684800ul:t;							//minimum time is 1/1/2000 for the hardware rtc
	RTCSetCNT(t);
	return t;
}

//read prll and prlh
uint32_t RTCGetPRL(void) {
	RTC->CRL &=~RTC_CRL_RSF; while ((RTC->CRL & RTC_CRL_RSF) == 0) continue;	//wait for RSF to be set (RTC in sync)
	return ((RTC->PRLH << 16) | RTC->PRLL) + 1;
}

//read divl and divh
uint32_t RTCGetDIV(void) {
	RTC->CRL &=~RTC_CRL_RSF; while ((RTC->CRL & RTC_CRL_RSF) == 0) continue;	//wait for RSF to be set (RTC in sync)
	return (RTC->DIVH << 16) | RTC->DIVL;
}

//returns:
//0: if 1st half second
//1: if 2nd half second
uint8_t RTCHalfsec(void) {
	return (RTCGetDIV() < RTCGetPRL() / 2)?0:1;
}

//set calibration register
void RTCSetCal(uint8_t cal) {
	//PWR->CR      |= PWR_CR_DBP;							// enable write access to RTC, BDC registers
	//unlocking sequence needed for CRL, CNT and ALR registers
	RTC->BKP_RTCCR = (RTC->BKP_RTCCR &~BKP_RTCCR_CAL) | (cal & BKP_RTCCR_CAL);
	//PWR->CR      &=~PWR_CR_DBP;							// disable access to RTC, BDC registers
}
//end rtcc
#endif	//rtc

//software rtc
volatile sRTC_TypeDef sRTC={(uint32_t) -1, 0, 0, 0};		//software RTC

//initialize software counter
void sRTCInit(void) {					//calibration from -128ppm to +128ppm, if sRTC_RATE = 1M
	//sRTC.tick_rate=sRTC_RATE;
	sRTC.time=(uint32_t) -1;			//reset counter: -1=uninitiated timer
	sRTC.tick=0;						//reset the tick counter
	sRTC.cal=0;							//initialize calibration
	sRTC.halfsec=0;						//0->1st half sec, 1->2nd half sec
}

//initialize the calibration
void sRTCSetCal(int16_t cal) {
	sRTC.cal=cal;
}

//increment sRTC time - called sRTC_CALLRATE per second
void sRTCISR(void) {
	uint32_t tks=ticks();				//timestamp tks
	if (tks - sRTC.tick > F_CPU) {		//if enough time has passed
		sRTC.tick += F_CPU;				//advance tick counter
		sRTC.time += 1;					//update time
	}
	sRTC.halfsec = (tks - sRTC.tick < F_CPU / 2)?0:1;
}

//read sRTC second counter
time_t sRTC2time(time_t *t) {
	if (t==NULL) return sRTC.time;
	return *t=sRTC.time;
}

//set sRTC second counter - used for initialization
//returns -1 if uninitialized
time_t time2sRTC(time_t t) {
	t=(t<946684800ul)?946684800ul:t;					//minimum time is 1/1/2000 for the hardware rtc
	return sRTC.time=t;
}

//read rtc tick
uint32_t sRTCTick(void) {
	return sRTC.tick;
}

//return half sec
//0: first half of a sec
//1: 2nd half of a sec
uint8_t sRTCHalfsec(void) {
	return sRTC.halfsec;
}

//end software rtc

//exti
//global variables
static void (* _exti0_isrptr )(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti1_isrptr )(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti2_isrptr )(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti3_isrptr )(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti4_isrptr )(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti5_isrptr )(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti6_isrptr )(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti7_isrptr )(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti8_isrptr )(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti9_isrptr )(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti10_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti11_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti12_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti13_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti14_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default
static void (* _exti15_isrptr)(void)=empty_handler;				//exti0 isrpointer pointing to empty_handler by default

