dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.c
//EXTI0-1 ISR
void EXTI0_1_IRQHandler(void) {
	//clear the flag and execute user isr
/*	switch (EXTI->PR) {
		case (1<<0): EXTI->PR |= (1<<0); _exti0_isrptr(); break;
		case (1<<1): EXTI->PR |= (1<<1); _exti1_isrptr(); break;
	}
*/
	if (EXTI->PR & (1<<0)) {EXTI->PR |= (1<<0); _exti0_isrptr();}
	if (EXTI->PR & (1<<1)) {EXTI->PR |= (1<<1); _exti1_isrptr();}

}

//EXTI2-3 ISR
void EXTI2_3_IRQHandler(void) {
	//clear the flag and execute user isr
/*	switch (EXTI->PR) {
		case (1<<2): EXTI->PR |= (1<<2); _exti2_isrptr(); break;
		case (1<<3): EXTI->PR |= (1<<3); _exti3_isrptr(); break;
	}
*/
	if (EXTI->PR & (1<<2)) {EXTI->PR |= (1<<2); _exti2_isrptr();}
	if (EXTI->PR & (1<<3)) {EXTI->PR |= (1<<3); _exti3_isrptr();}
}

//EXTI15-10 ISR
void EXTI4_15_IRQHandler(void) {
	//clear the flag and execute user isr
/*
	switch (EXTI->PR) {
		case (1<< 4): EXTI->PR |= (1<< 4); _exti4_isrptr(); break;
		case (1<< 5): EXTI->PR |= (1<< 5); _exti5_isrptr(); break;
		case (1<< 6): EXTI->PR |= (1<< 6); _exti6_isrptr(); break;
		case (1<< 7): EXTI->PR |= (1<< 7); _exti7_isrptr(); break;
		case (1<< 8): EXTI->PR |= (1<< 8); _exti8_isrptr(); break;
		case (1<< 9): EXTI->PR |= (1<< 9); _exti9_isrptr(); break;
		case (1<<10): EXTI->PR |= (1<<10); _exti10_isrptr(); break;
		case (1<<11): EXTI->PR |= (1<<11); _exti11_isrptr(); break;
		case (1<<12): EXTI->PR |= (1<<12); _exti12_isrptr(); break;
		case (1<<13): EXTI->PR |= (1<<13); _exti13_isrptr(); break;
		case (1<<14): EXTI->PR |= (1<<14); _exti14_isrptr(); break;
		case (1<<15): EXTI->PR |= (1<<15); _exti15_isrptr(); break;
	}
*/
	if (EXTI->PR & (1<< 4)) {EXTI->PR |= (1<< 4); _exti4_isrptr();}
	if (EXTI->PR & (1<< 5)) {EXTI->PR |= (1<< 5); _exti5_isrptr();}
	if (EXTI->PR & (1<< 6)) {EXTI->PR |= (1<< 6); _exti6_isrptr();}
	if (EXTI->PR & (1<< 7)) {EXTI->PR |= (1<< 7); _exti7_isrptr();}
	if (EXTI->PR & (1<< 8)) {EXTI->PR |= (1<< 8); _exti8_isrptr();}
	if (EXTI->PR & (1<< 9)) {EXTI->PR |= (1<< 9); _exti9_isrptr();}
	if (EXTI->PR & (1<<10)) {EXTI->PR |= (1<<10); _exti10_isrptr();}
	if (EXTI->PR & (1<<11)) {EXTI->PR |= (1<<11); _exti11_isrptr();}
	if (EXTI->PR & (1<<12)) {EXTI->PR |= (1<<12); _exti12_isrptr();}
	if (EXTI->PR & (1<<13)) {EXTI->PR |= (1<<13); _exti13_isrptr();}
	if (EXTI->PR & (1<<14)) {EXTI->PR |= (1<<14); _exti14_isrptr();}
	if (EXTI->PR & (1<<15)) {EXTI->PR |= (1<<15); _exti15_isrptr();}
}

//global defines

//global variables
//initialize the exti
//pin: one pin only
//gpio: GPIOA..GPIOG
//void extiInit(GPIO_TypeDef * gpio, uint16_t pin, uint8_t edge) {
void extiInit(PIN_TypeDef PINx, uint8_t edge) {
	uint16_t tmp=0;
	GPIO_TypeDef *gpio;
	uint16_t pin;
	
	gpio=GPIO_PinDef[PINx].gpio;
	pin =GPIO_PinDef[PINx].mask;
	//enable afio
	RCC->APBENR2 |= RCC_APBENR2_SYSCFGEN;
	//enable the clock
#if 0
	switch ((uint32_t) gpio) {
#if defined(GPIOA)
		case (uint32_t) GPIOA: RCC->IOPENR |= RCC_IOPENR_GPIOAEN_Pos; tmp = 0x00; break;
#endif
#if defined(GPIOB)
		case (uint32_t) GPIOB: RCC->IOPENR |= RCC_IOPENR_GPIOBEN_Pos; tmp = 0x01; break;
#endif
#if defined(GPIOC)
		case (uint32_t) GPIOC: RCC->IOPENR |= RCC_IOPENR_GPIOCEN_Pos; tmp = 0x02; break;
#endif
#if defined(GPIOD)
		case (uint32_t) GPIOD: RCC->IOPENR |= RCC_IOPENR_GPIODEN_Pos; tmp = 0x03; break;
#endif
#if defined(GPIOE)
		case (uint32_t) GPIOE: RCC->IOPENR |= RCC_IOPENR_GPIOEEN_Pos; tmp = 0x04; break;
#endif
#if defined(GPIOF)
		case (uint32_t) GPIOF: RCC->IOPENR |= RCC_IOPENR_GPIOFEN_Pos; tmp = 0x05; break;
#endif
#if defined(GPIOG)
		case (uint32_t) GPIOG: RCC->IOPENR |= RCC_IOPENR_GPIOGEN_Pos; tmp = 0x06; break;
#endif
	}
#else

#if defined(GPIOA)
		if (gpio == GPIOA) {RCC->IOPENR |= RCC_IOPENR_GPIOAEN_Pos; tmp = 0x00;}
#endif
#if defined(GPIOB)
		if (gpio == GPIOB) {RCC->IOPENR |= RCC_IOPENR_GPIOBEN_Pos; tmp = 0x01;}
#endif
#if defined(GPIOC)
		if (gpio == GPIOC) {RCC->IOPENR |= RCC_IOPENR_GPIOCEN_Pos; tmp = 0x02;}
#endif
#if defined(GPIOD)
		if (gpio == GPIOD) {RCC->IOPENR |= RCC_IOPENR_GPIODEN_Pos; tmp = 0x03;}
#endif
#if defined(GPIOE)
		if (gpio == GPIOE) {RCC->IOPENR |= RCC_IOPENR_GPIOEEN_Pos; tmp = 0x04;}
#endif
#if defined(GPIOF)
		if (gpio == GPIOF) {RCC->IOPENR |= RCC_IOPENR_GPIOFEN_Pos; tmp = 0x05;}
#endif
#if defined(GPIOG)
		if (gpio == GPIOG) {RCC->IOPENR |= RCC_IOPENR_GPIOGEN_Pos; tmp = 0x06; break;}
#endif

#endif
	//configure exti edges
	//1->falling/rising edge enabled, 0->falling/rising edge disabled
	switch (edge) {
		case EXTI_FALLING: 	EXTI->FTSR |= pin; EXTI->RTSR &=~pin; break;
		case EXTI_RISING: 	EXTI->FTSR &=~pin; EXTI->RTSR |= pin; break;
		case EXTI_BOTH: 	EXTI->FTSR |= pin; EXTI->RTSR |= pin; break;
	}
	//configure the port
	switch (pin) {
		case (1<< 0): EXTI->EXTICR[0] = (EXTI->EXTICR[0] &~0x000f) | ((tmp) <<  0); break;
		case (1<< 1): EXTI->EXTICR[0] = (EXTI->EXTICR[0] &~0x00f0) | ((tmp) <<  4); break;
		case (1<< 2): EXTI->EXTICR[0] = (EXTI->EXTICR[0] &~0x0f00) | ((tmp) <<  8); break;
		case (1<< 3): EXTI->EXTICR[0] = (EXTI->EXTICR[0] &~0xf000) | ((tmp) << 12); break;
		case (1<< 4): EXTI->EXTICR[1] = (EXTI->EXTICR[1] &~0x000f) | ((tmp) <<  0); break;
		case (1<< 5): EXTI->EXTICR[1] = (EXTI->EXTICR[1] &~0x00f0) | ((tmp) <<  4); break;
		case (1<< 6): EXTI->EXTICR[1] = (EXTI->EXTICR[1] &~0x0f00) | ((tmp) <<  8); break;
		case (1<< 7): EXTI->EXTICR[1] = (EXTI->EXTICR[1] &~0xf000) | ((tmp) << 12); break;
		case (1<< 8): EXTI->EXTICR[2] = (EXTI->EXTICR[2] &~0x000f) | ((tmp) <<  0); break;
		case (1<< 9): EXTI->EXTICR[2] = (EXTI->EXTICR[2] &~0x00f0) | ((tmp) <<  4); break;
		case (1<<10): EXTI->EXTICR[2] = (EXTI->EXTICR[2] &~0x0f00) | ((tmp) <<  8); break;
		case (1<<11): EXTI->EXTICR[2] = (EXTI->EXTICR[2] &~0xf000) | ((tmp) << 12); break;
		//case (1<<12): EXTI->EXTICR[3] = (EXTI->EXTICR[3] &~0x000f) | ((tmp) <<  0); break;
		//case (1<<13): EXTI->EXTICR[3] = (EXTI->EXTICR[3] &~0x00f0) | ((tmp) <<  4); break;
		//case (1<<14): EXTI->EXTICR[3] = (EXTI->EXTICR[3] &~0x0f00) | ((tmp) <<  8); break;
		//case (1<<15): EXTI->EXTICR[3] = (EXTI->EXTICR[3] &~0xf000) | ((tmp) << 12); break;
	};
}

