dannyf00/Benchmark---CoreMark/coremark/port_py32f0/py32duino.c
//install user handler
//void extiAttachISR(uint16_t pin, void (*isr_ptr)(void)) {
void extiAttachISR(PIN_TypeDef PINx, void (*isr_ptr)(void)) {
	//GPIO_TypeDef *gpio;
	uint16_t pin;
	
	//gpio=GPIO_PinDef[PINx].gpio;
	pin =GPIO_PinDef[PINx].mask;
	//clear the flag
	EXTI->PR |= pin;						//1->clear the flag
	//enable the interrupt
	EXTI->IMR |= pin;							//1->enable the interrupt, 0->disable the interrupt
	EXTI->EMR |= pin;							//1->enable the event trigger, 0->disable the event trigger

	//enable nvic
	switch (pin) {
		case (1<< 0): NVIC_EnableIRQ(EXTI0_1_IRQn ); _exti0_isrptr  = isr_ptr; break;
		case (1<< 1): NVIC_EnableIRQ(EXTI0_1_IRQn ); _exti1_isrptr  = isr_ptr; break;
		case (1<< 2): NVIC_EnableIRQ(EXTI2_3_IRQn ); _exti2_isrptr  = isr_ptr; break;
		case (1<< 3): NVIC_EnableIRQ(EXTI2_3_IRQn ); _exti3_isrptr  = isr_ptr; break;
		case (1<< 4): NVIC_EnableIRQ(EXTI4_15_IRQn); _exti4_isrptr  = isr_ptr; break;
		case (1<< 5): NVIC_EnableIRQ(EXTI4_15_IRQn); _exti5_isrptr  = isr_ptr; break;
		case (1<< 6): NVIC_EnableIRQ(EXTI4_15_IRQn); _exti6_isrptr  = isr_ptr; break;
		case (1<< 7): NVIC_EnableIRQ(EXTI4_15_IRQn); _exti7_isrptr  = isr_ptr; break;
		case (1<< 8): NVIC_EnableIRQ(EXTI4_15_IRQn); _exti8_isrptr  = isr_ptr; break;
		case (1<< 9): NVIC_EnableIRQ(EXTI4_15_IRQn); _exti9_isrptr  = isr_ptr; break;
		case (1<<10): NVIC_EnableIRQ(EXTI4_15_IRQn); _exti10_isrptr = isr_ptr; break;
		case (1<<11): NVIC_EnableIRQ(EXTI4_15_IRQn); _exti11_isrptr = isr_ptr; break;
		case (1<<12): NVIC_EnableIRQ(EXTI4_15_IRQn); _exti12_isrptr = isr_ptr; break;
		case (1<<13): NVIC_EnableIRQ(EXTI4_15_IRQn); _exti13_isrptr = isr_ptr; break;
		case (1<<14): NVIC_EnableIRQ(EXTI4_15_IRQn); _exti14_isrptr = isr_ptr; break;
		case (1<<15): NVIC_EnableIRQ(EXTI4_15_IRQn); _exti15_isrptr = isr_ptr; break;
	}
}

//end exti

//analog random number - generate true random number with analog read
//analog random
//generate 4-bit random numbers
uint8_t arand4(void) {
	uint8_t tmp=arand1();

	//tmp = (tmp << 1) | arand1();
	tmp = (tmp << 1) | arand1();
	tmp = (tmp << 1) | arand1();
	tmp = (tmp << 1) | arand1();
	return tmp;
}

//generate 8-bit random number
uint8_t arand8(void) {
	return (arand4() << 4) | arand4();
}

//return 16-bit random number
uint16_t arand16(void) {
	return ((uint16_t) arand8() << 8) | arand8();
}


//return 32-bit random number
uint32_t arand32(void) {
	return ((uint32_t) arand16() << 16) | arand16();
}
//end analog random
//end analog random number

//circular buffer
//global defines
#define cBUFF_SIZE_MASK 	(cBUFF_SIZE-1U)		//mask

//global variables
//reset the cbuffer
void cbInit(CB_TypeDef *cbuffer) {
	cbuffer->writeIndex = cbuffer->readIndex = (uint16_t) -1;
}

//returns true if cbuffer is empty
char cbEmpty(CB_TypeDef *cbuffer) {
	return (cbuffer->writeIndex & cBUFF_SIZE_MASK) == (cbuffer->readIndex & cBUFF_SIZE_MASK);
}

//returns true if cbuffer is full;
char cbFull(CB_TypeDef *cbuffer) {
	return ((cbuffer->writeIndex + 1) & cBUFF_SIZE_MASK) == (cbuffer->readIndex & cBUFF_SIZE_MASK);
}

//write to the buffer - needs to test if the buffer is full before writing to it
cbuffer_t cbWrite(CB_TypeDef *cbuffer, cbuffer_t dat) {
	cbuffer->buffer[(++cbuffer->writeIndex) & cBUFF_SIZE_MASK] = dat;
	return dat;
}

//read from the buffer - needs to test if the buffer is empty before reading from it
cbuffer_t cbRead(CB_TypeDef *cbuffer) {
	return cbuffer->buffer[(++cbuffer->readIndex) & cBUFF_SIZE_MASK];
}

//write string to CB
void str2cb(CB_TypeDef *cb, char *str) {
	while (!cbFull(cb) && (*str)) cbWrite(cb, *str++);
}

//write CB to string
void cb2str(char *str, CB_TypeDef *cb) {
	while (!cbEmpty(cb)) *str++=cbRead(cb);
}

//end circular buffer

